[
  {
    "text": "Những điều kiện và tiền đề khách quan nào dẫn đến sự ra đời của chủ nghĩa xã hội khoa học?",
    "type": "Multiple Choice",
    "options": [
      "A. Sự ra đời và phát triển của nền đại công nghiệp tư bản chủ nghĩa",
      "B. Sự trưởng thành của giai cấp công nhân công nghiệp",
      "C. Những thành tựu khoa học tự nhiên và tư tưởng lí luận đầu thế kỉ 19",
      "D. Cả A, B và C"
    ],
    "correct": 4
  },
  {
    "text": "Những phát minh nào trong lĩnh vực khoa học tự nhiên là tiền đề cho sự ra đời của chủ nghĩa xã hội khoa học?",
    "type": "Multiple Choice",
    "options": [
      "A. Học thuyết tiến hoá",
      "B. Định luật bảo toàn và chuyển hoá năng lượng",
      "C. Học thuyết tế bào",
      "D. Cả A, B và C"
    ],
    "correct": 4
  },
  {
    "text": "Ph. Ăngghen đã đánh giá: “Hai phát hiện vĩ đại này đã đưa chủ nghĩa xã hội trở thành một khoa học”. Hai phát kiến đó là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa duy vật biện chứng và chủ nghĩa duy vật lịch sử",
      "B. Sứ mệnh lịch sử của giai cấp công nhân – Học thuyết giá trị thặng dư",
      "C. Học thuyết giá trị thặng dư – Chủ nghĩa duy vật lịch sử",
      "D. Sứ mệnh lịch sử của giai cấp công nhân – Chủ nghĩa duy vật lịch sử"
    ],
    "correct": 3
  },
  {
    "text": "Đâu là tiền đề tư tưởng lý luận của chủ nghĩa xã hội khoa học?",
    "type": "Multiple Choice",
    "options": [
      "A. Triết học cổ điển Đức",
      "B. Kinh tế chính trị học cổ điển Anh",
      "C. Chủ nghĩa xã hội không tưởng - phê phán",
      "D. Cả A, B và C"
    ],
    "correct": 4
  },
  {
    "text": "Tác phẩm “Tuyên ngôn của Đảng cộng sản” được viết vào năm nào?",
    "type": "Multiple Choice",
    "options": [
      "A. 1838",
      "B. 1848",
      "C. 1858",
      "D. 1828"
    ],
    "correct": 2
  },
  {
    "text": "Đâu là những phát kiến vĩ đại của C. Mác và Ph. Ăngghen?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa duy vật lịch sử",
      "B. Học thuyết về giá trị thặng dư",
      "C. Học thuyết về sứ mệnh lịch sử toàn thế giới của giai cấp công nhân",
      "D. Cả A,B, và C"
    ],
    "correct": 4
  },
  {
    "text": "Phát kiến nào của C. Mác và Ph. Ăngghen chỉ ra sự diệt vong về kinh tế của chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa duy vật lịch sử",
      "B. Học thuyết về giá trị thặng dư",
      "C. Học thuyết về sứ mệnh lịch sử toàn thế giới của giai cấp công nhân",
      "D. Cả ba phương án trên"
    ],
    "correct": 2
  },
  {
    "text": "Nội dung cơ bản nhất mà nhờ đó chủ nghĩa xã hội từ không tưởng trở thành khoa học?",
    "type": "Multiple Choice",
    "options": [
      "A. Lên án mạnh mẽ chủ nghĩa tư bản.",
      "B. Phản ánh đúng khát vọng của nhân dân lao động bị áp bức.",
      "C. Phát hiện ra giai cấp công nhân là lực lượng xã hội có thể thủ tiêu CNTB, xây dựng CNXH.",
      "D. Chỉ ra sự cần thiết phải thay thế chủ nghĩa tư bản bằng chủ nghĩa xã hội."
    ],
    "correct": 3
  },
  {
    "text": "Trong phương thức sản xuất tư bản chủ nghĩa, mâu thuẫn về phương diện chính trị - xã hội là mâu thuẫn giữa giai cấp...",
    "type": "Multiple Choice",
    "options": [
      "A. Vô sản với tư sản",
      "B. Chủ nô với nô lệ",
      "C. Nông dân với địa chủ",
      "D. Tất cả các phương án đều sai"
    ],
    "correct": 1
  },
  {
    "text": "Chỉ ra luận điểm đúng?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa xã hội khoa học là một trong ba bộ phận cấu thành của chủ nghĩa Mác.",
      "B. Chủ nghĩa xã hội khoa học là một trong ba xu hướng của chủ nghĩa Mác.",
      "C. Chủ nghĩa xã hội khoa học là một trong ba tiền đề tư tưởng của chủ nghĩa Mác.",
      "D. Chủ nghĩa xã hội khoa học là một trong ba nguồn gốc hình thành chủ nghĩa Mác."
    ],
    "correct": 1
  },
  {
    "text": "Những nhà chủ nghĩa xã hội không tưởng nào đã không luận chứng được một cách khoa học về bản chất và quy luật phát triển của chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. A.Xmit và Đ. Ricácđô",
      "B. H.Xanh Ximông, S. Phuriê và R. Ôoen",
      "C. C. Mác và Ph. Ăngghen",
      "D. Tất cả các phương án đều sai"
    ],
    "correct": 2
  },
  {
    "text": "Điền vào chỗ trống (...) để hoàn thiện luận điểm của V.I. Lênin: “Điểm chủ yếu trong học thuyết của Mác là ở chỗ nó làm sáng rõ vai trò lịch sử thế giới của (...) là người xây dựng xã hội xã hội chủ nghĩa” .",
    "type": "Multiple Choice",
    "options": [
      "A. Tầng lớp trí thức.",
      "B. Giai cấp tư sản.",
      "C. Giai cấp vô sản.",
      "D. Tầng lớp doanh nhân."
    ],
    "correct": 3
  },
  {
    "text": "Vai trò của V.I. Lênin đối với chủ nghĩa xã hội biểu hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Đưa chủ nghĩa xã hội từ phương Tây sang phương Đông",
      "B. Đưa chủ nghĩa xã hội từ một nước trở thành hệ thống.",
      "C. Đưa chủ nghĩa xã hội từ không tưởng thành khoa học.",
      "D. Đưa chủ nghĩa xã hội từ lý luận thành hiện thực."
    ],
    "correct": 4
  },
  {
    "text": "Vai trò của C. Mác và Ph. Ăngghen đối với chủ nghĩa xã hội biểu hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Đưa chủ nghĩa xã hội từ không tưởng trở thành khoa học.",
      "B. Đưa chủ nghĩa xã hội từ lý luận thành hiện thực.",
      "C. Đưa chủ nghĩa xã hội hiện thực từ một nước trở thành hệ thống.",
      "D. Đưa chủ nghĩa xã hội từ Anh sang Đức."
    ],
    "correct": 1
  },
  {
    "text": "Tiền đề tư tưởng trực tiếp ra đời chủ nghĩa xã hội khoa học là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa duy vật lịch sử và chủ nghĩa duy vật biện chứng.",
      "B. Chủ nghĩa xã hội tiểu tư sản",
      "C. Chủ nghĩa xã hội phong kiến",
      "D. Chủ nghĩa xã hội không tưởng Pháp."
    ],
    "correct": 4
  },
  {
    "text": "Hãy chỉ ra nhân tố chủ quan quan trọng nhất để giai cấp công nhân thực hiện thắng lợi sứ mệnh lịch sử của mình?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân có số lượng đông",
      "B. Đảng Cộng sản.",
      "C. Giai cấp công nhân là lực lượng tiên tiến nhất trong xã hội hiện đại",
      "D. Cả 3 phương án trên"
    ],
    "correct": 2
  },
  {
    "text": "Điều kiện khách quan nào quy định sứ mệnh lịch sử của giai cấp công nhân?",
    "type": "Multiple Choice",
    "options": [
      "A. Địa vị kinh tế và địa vị chính trị - xã hội của giai cấp công nhân",
      "B. Là con đẻ của nền đại công nghiệp",
      "C. Do sự phát triển của lực lượng sản xuất hiện đại",
      "D. Cả 3 phương án trên"
    ],
    "correct": 4
  },
  {
    "text": "Điền từ còn thiếu vào chỗ trống: Giai cấp công nhân là cơ sở.... và nguồn bổ sung lực lượng của Đảng cộng sản.",
    "type": "Fill-in-the-Blank",
    "correct": "Xã hội"
  },
  {
    "text": "Xét trong quan hệ sản xuất tư bản chủ nghĩa giai cấp công nhân là:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp nghèo khổ nhất",
      "B. Giai cấp không có tư liệu sản xuất, đi làm thuê cho nhà tư bản, bị nhà tư bản bóc lột giá trị thặng dư",
      "C. Giai cấp có số lượng đông trong dân cư",
      "D. Cả 3 phương án trên"
    ],
    "correct": 2
  },
  {
    "text": "Giai cấp công nhân trên phương diện chính trị - xã hội, bao gồm những đặc điểm chủ yếu là:",
    "type": "Multiple Choice",
    "options": [
      "A. Lao động bằng phương thức công nghiệp.",
      "B. Là sản phẩm bản thân nền đại công nghiệp, là chủ thể của quá trình sản xuất vật chất hiện đại.",
      "C. Là một giai cấp cách mạng và có tinh thần cách mạng triệt để.",
      "D. Cả 3 phương án trên"
    ],
    "correct": 4
  },
  {
    "text": "Đặc điểm sứ mệnh lịch sử của giai cấp công nhân:",
    "type": "Multiple Choice",
    "options": [
      "A. Thay thế chế độ sở hữu tư nhân này bằng một chế độ sở hữu tư nhân khác",
      "B. Xoá bỏ triệt để chế độ tư hữu về tư liệu sản xuất",
      "C. Thay thế chế độ chiếm hữu nô lệ bằng chế độ xã hội chủ nghĩa",
      "D. Cả 3 phương án trên"
    ],
    "correct": 2
  },
  {
    "text": "Đâu là điều kiện chủ quan để giai cấp công nhân thực hiện sứ mệnh lịch sử của mình?",
    "type": "Multiple Choice",
    "options": [
      "A. Sự phát triển của bản thân giai cấp công nhân cả về số lượng và chất lượng",
      "B. Đảng Cộng sản là nhân tố chủ quan quan trọng nhất để giai cấp công nhân thực hiện thắng lợi sứ mệnh lịch sử của mình",
      "C. Sự liên minh giữa giai cấp công nhân với giai cấp nông dân và các tầng lớp lao động khác",
      "D. Cả 3 phương án trên"
    ],
    "correct": 4
  },
  {
    "text": "Đặc điểm của giai cấp công nhân Việt Nam là:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân Việt Nam ra đời sớm",
      "B. Giai cấp công nhân Việt Nam gắn bó mật thiết với các tầng lớp nhân dân trong xã hội.",
      "C. Giai cấp công nhân Việt Nam là con đẻ của nền đại công nghiệp",
      "D. Cả 3 phương án trên"
    ],
    "correct": 2
  },
  {
    "text": "Giai cấp công nhân là giai cấp triệt để cách mạng?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Đảng cộng sản là nhân tố khách quan quan trọng nhất để giai cấp công nhân thực hiện sứ mệnh lịch sử của mình?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 2
  },
  {
    "text": "Mục tiêu cao nhất của giai cấp công nhân là giải phóng con người?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Công nhân hiện đại có xu hướng trí tuệ hoá?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Giai cấp công nhân có nguồn gốc xuất thân từ những giai cấp, tầng lớp nào trong xã hội?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp nông dân.",
      "B. Thợ thủ công.",
      "C. Tiểu tư sản.",
      "D. Từ tất cả giai cấp, tầng lớp."
    ],
    "correct": 4
  },
  {
    "text": "Hoàn thành luận điểm của C.Mác và Ph.Ăngghen: “tất cả các giai cấp khác đều suy tàn và tiêu vong cùng với sự phát triển của đại công nghiệp, còn giai cấp vô sản lại là (…..) của bản thân nền đại công nghiệp’’.",
    "type": "Fill-in-the-Blank",
    "correct": "Sản phẩm"
  },
  {
    "text": "Trong xã hội tư bản chủ nghĩa, địa vị xã hội của giai cấp công nhân biểu hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Là giai cấp thống trị và chiếm đoạt giá trị thặng dư.",
      "B. Giai cấp không có tư liệu sản xuất chủ yếu, phải bán sức lao động cho nhà tư bản và bị nhà tư bản bóc lột giá trị thặng dư.",
      "C. Giai cấp có tư liệu sản xuất nên làm chủ giá trị thặng dư.",
      "D. Giai cấp có lợi ích cơ bản thống nhất với lợi ích của giai cấp tư sản."
    ],
    "correct": 2
  },
  {
    "text": "Chọn cụm từ dưới đây để hoàn thành luận điểm sau: Trong chế độ tư bản chủ nghĩa, giai cấp công nhân có lợi ích cơ bản (……) với lợi ích giai cấp tư sản.",
    "type": "Multiple Choice",
    "options": [
      "A. Thống nhất.",
      "B. Phù hợp.",
      "C. Đối lập trực tiếp.",
      "D. Đối lập gián tiếp."
    ],
    "correct": 3
  },
  {
    "text": "Sự khác nhau căn bản giữa giai cấp công nhân ở các nước tư bản chủ nghĩa và xã hội chủ nghĩa biểu hiện điều gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Phương thức lao động, phương thức sản xuất.",
      "B. Quan hệ sở hữu đối với tư liệu sản xuất chủ yếu của xã hội.",
      "C. Nguồn gốc xuất thân của giai cấp công nhân.",
      "D. Sản phẩm lao động của giai cấp công nhân."
    ],
    "correct": 2
  },
  {
    "text": "Giai cấp, tầng lớp nào đại điện cho lực lượng sản xuất tiên tiến trong chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân",
      "B. Giai cấp tư sản",
      "C. Giai cấp nông dân.",
      "D. Tầng lớp tri thức."
    ],
    "correct": 1
  },
  {
    "text": "Chọn cụm từ dưới đây để hoàn thành luận điểm của C.Mác và Ph.Ăngghen: “trong tất cả các giai cấp hiện đang đối lập với giai cấp tư sản thì chỉ có (…) là giai cấp thực sự cách mạng”.",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp vô sản.",
      "B. Tầng lớp tiểu tư sản.",
      "C. Tầng lớp tri thức.",
      "D. Giai cấp nông dân"
    ],
    "correct": 1
  },
  {
    "text": "Sứ mệnh lịch sử của giai cấp công nhân là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Ủng hộ nhân dân lạo động xóa bỏ chủ nghĩa tư bản, xây dựng chủ nghĩa xã hội.",
      "B. Ủng hộ giai cấp tư sản xóa bỏ chế độ phong kiến, xây dựng chế độ tư bản chủ nghĩa.",
      "C. Lãnh đạo nhân dân lạo động xóa bỏ chế độ chiếm hữu nô lệ, xây xây dựng chế độ phong kiến.",
      "D. Lãnh đạo cuộc đấu tranh của nhân dân lao động xóa bỏ chế độ tư bản chủ nghĩa, xóa bỏ mọi chế độ áp bức bóc lột và xây dựng thành công chủ nghĩa xã hội - chủ nghĩa cộng sản."
    ],
    "correct": 4
  },
  {
    "text": "Điều kiện khách quan quy định sứ mệnh lịch sử của giai cấp công nhân là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Địa vị kinh tế xã hội của giai cấp công nhân và đặc điểm chính trị xã hội của giai cấp công nhân",
      "B. Tình hình tinh thần cách mạng triệt để của giai cấp công nhân và nhân dân lao động",
      "C. Tinh thần đoàn kết quốc tế của giai cấp công nhân và nhân dân lao động.",
      "D. Tổ chức chính trị vững mạnh của giai cấp công nhân và sự đồng tình của nhân dân lao động"
    ],
    "correct": 1
  },
  {
    "text": "Vì sao giai cấp công nhân có khả năng đoàn kết với các giai cấp tầng lớp lao động khác trong xã hội?",
    "type": "Multiple Choice",
    "options": [
      "A. Vì giai cấp công nhân có lợi ích cơ bản thống nhất với lợi ích của các các giai cấp tầng lớp lao động khác trong xã hội.",
      "B. Vì giai cấp công nhân là giai cấp lãnh đạo giai cấp tầng lớp lao động ảnh trong xã hội.",
      "C. Vì giai cấp công nhân có số lượng đông đảo nhất trong xã hội nên sức hút giai cấp công nhân Sơn lớn nhất.",
      "D. Vì giai cấp công nhân có nhiều tổ chức chính trị và đoàn thể xã hội để huy động các giai cấp tầng lớp khác trong xã hội."
    ],
    "correct": 1
  },
  {
    "text": "Nhân tố chủ quan nào có ý nghĩa quyết định đối với việc thực hiện sứ mệnh lịch sử của giai cấp công nhân?",
    "type": "Multiple Choice",
    "options": [
      "A. Vai trò lãnh đạo của Đảng cộng sản.",
      "B. Vai trò của giai cấp công nhân.",
      "C. Vai trò của giai cấp tư sản.",
      "D. Vai trò của tầng lớp trí thức."
    ],
    "correct": 1
  },
  {
    "text": "Mục tiêu cao nhất trong sự nghiệp cách mạng của giai cấp công nhân là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Giành chính quyền về tay giai cấp công nhân và nhân dân lao động trên cơ sở lật đổ chính quyền của giai cấp bóc lột.",
      "B. Đánh đổ chế độ tư bản, xóa bỏ áp bức, bóc lột, bất công trong xã hội tư bản chủ nghĩa.",
      "C. Giải phóng giai cấp công nhân và nhân dân lao động, đồng thời giải phóng xã hội thoát khỏi áp bức, bóc lột, bất công, xây dựng chủ nghĩa xã hội, chủ nghĩa cộng sản.",
      "D. Giành quyền làm chủ tư liệu sản xuất về tay giai cấp công nhân và nhân dân lao động."
    ],
    "correct": 3
  },
  {
    "text": "Hoàn thành luận điểm sau: “Đảng Cộng sản ra đời là sản phẩm của sự kết hợp giữa chủ nghĩa Mác với (……)”.",
    "type": "Fill-in-the-Blank",
    "correct": "Phong trào công nhân"
  },
  {
    "text": "Chọn cụm từ dưới đây để hoàn thành luận điểm sau: “giai cấp công nhân là (……) của Đảng Cộng Sản, là nguồn bổ sung lực lượng phong phú cho Đảng Cộng Sản”.",
    "type": "Multiple Choice",
    "options": [
      "A. Cơ sở chính trị",
      "B. Cơ sở giai cấp",
      "C. Cơ sở xã hội",
      "D. Cơ sở kinh tế"
    ],
    "correct": 2
  },
  {
    "text": "Vì sao giai cấp công nhân là giai cấp có tinh thần cách mạng triệt để nhất?",
    "type": "Multiple Choice",
    "options": [
      "A. Vì giai cấp công nhân có lợi ích cơ bản phù hợp với lợi ích của nhân dân lao động",
      "B. Vì giai cấp công nhân là giai cấp nào khó nhất trong xã hội",
      "C. Vì cuộc cách mạng do giai cấp công nhân tiến hành nhằm xóa bỏ mâu thuẫn giai cấp trong xã hội tư bản chủ nghĩa",
      "D. Vì giai cấp công nhân có lợi ích đối kháng trực tiếp với lợi ích của giai cấp tư sản."
    ],
    "correct": 4
  },
  {
    "text": "Vì sao giai cấp công nhân là giai cấp tiên tiến nhất?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân bị giai cấp tư sản áp bức bóc lột nặng nề.",
      "B. Giai cấp công nhân có số lượng đông đảo trong dân cư và lực lượng lao động xã hội.",
      "C. Giai cấp công nhân đại biểu cho lực lượng sản xuất hiện đại, cho phương thức sản xuất tiên tiến.",
      "D. Giai cấp công nhân có hệ tư tưởng độc lập, tiên tiến vào đảng cộng sản lãnh đạo"
    ],
    "correct": 3
  },
  {
    "text": "Giai cấp nào đại biểu cho quan hệ tư nhân tư bản chủ nghĩa?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân.",
      "B. Giai cấp tư sản.",
      "C. Tầng lớp thanh niên.",
      "D. Tầng lớp trí thức."
    ],
    "correct": 2
  },
  {
    "text": "Giai cấp công nhân Việt Nam ra đời trong hoàn cảnh lịch sử nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Trong kháng chiến chống thực dân Pháp giai đoạn 1946-1954.",
      "B. Trong kháng chiến chống Mỹ giai đoạn 1954 - 1975.",
      "C. Trong thời kỳ quá độ lên Chủ nghĩa xã hội.",
      "D. Trong cuộc khai thác thuộc địa của Pháp cuối thế kỷ XIX đầu thế kỷ XX."
    ],
    "correct": 4
  },
  {
    "text": "Đảng cộng sản Việt Nam ra đời là sản phẩm của sự kết hợp giữa chủ nghĩa Mác - Lênin với phong trào công nhân và yếu tố nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Tư tưởng đoàn kết cộng đồng.",
      "B. Tư tưởng Hồ Chí Minh.",
      "C. Phong trào nông dân.",
      "D. Phong trào yêu nước."
    ],
    "correct": 4
  },
  {
    "text": "Nhân tố nào quan trọng nhất được coi là ngọn cờ tư tưởng dẫn dắt giai cấp công nhân hoàn thành sứ mệnh lịch sử của mình?",
    "type": "Multiple Choice",
    "options": [
      "A. Tinh thần đoàn kết",
      "B. Chủ nghĩa Mác - Lênin",
      "C. Lý luận khoa học",
      "D. Tinh thần cách mạng"
    ],
    "correct": 2
  },
  {
    "text": "Đảng Cộng sản ra đời và đảm nhận vai trò lãnh đạo cách mạng, đánh dấu điều gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân phát triển về lượng",
      "B. Sự trưởng thành vượt bậc của giai cấp công nhân",
      "C. Dự báo sự thắng lợi của giai cấp tư sản",
      "D. Tất cả các đáp án"
    ],
    "correct": 2
  },
  {
    "text": "Điền từ còn thiếu vào chỗ trống: “Đảng cộng sản là...của giai cấp công nhân”",
    "type": "Fill-in-the-Blank",
    "correct": "Đội tiên phong"
  },
  {
    "text": "Tìm đáp án đúng nhất, Đảng Cộng sản đại biểu cho lợi ích và trí tuệ của ai?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân và nhân dân lao động",
      "B. Chỉ giai cấp công nhân và giai cấp tư sản",
      "C. Giai cấp tư sản",
      "D. Giai cấp nông dân"
    ],
    "correct": 1
  },
  {
    "text": "Để hoàn thành sứ mệnh lịch sử, giai cấp công nhân tất yếu phải liên minh với giai cấp nào ?",
    "type": "Multiple Choice",
    "options": [
      "A. Tư sản",
      "B. Nông dân",
      "C. Tiểu tư sản",
      "D. Tất cả các đáp án trên"
    ],
    "correct": 2
  },
  {
    "text": "Điểm tương đồng giữa giai cấp công nhân hiện nay so với giai cấp công nhân truyền thống ở thế kỷ XIX:",
    "type": "Multiple Choice",
    "options": [
      "A. Là lực lượng sản xuất hàng đầu của xã hội hiện đại",
      "B. Ở các nước tư bản chủ nghĩa, giai cấp công nhân bị giai cấp tư sản bóc lột giá trị thặng dư",
      "C. Giai cấp công nhân là lực lượng đi đầu trong các cuộc đấu tranh cách mạng",
      "D. Tất cả các đáp án trên"
    ],
    "correct": 4
  },
  {
    "text": "Giai cấp công nhân hiện nay có biến đổi và khác biệt gì so với giai cấp công nhân truyền thống ở thế kỷ XIX?",
    "type": "Multiple Choice",
    "options": [
      "A. Có xu hướng trí tuệ hóa",
      "B. Là công nhân tri thức",
      "C. Hao phí lao động hiện đại chủ yếu là về trí lực chứ không thuần túy hao phí sức lực cơ bắp",
      "D. Tất cả các đáp án"
    ],
    "correct": 4
  },
  {
    "text": "Những thuật ngữ: Công nhân tri thức, công nhân trí thức, công nhân áo trắng, công nhân trình độ cao...dùng để chỉ giai cấp công nhân theo xu hướng nào:",
    "type": "Multiple Choice",
    "options": [
      "A. Xu hướng trí tuệ hóa",
      "B. Xu hướng phát triển",
      "C. Xu hướng hiện đại",
      "D. Xu hướng đoàn kết"
    ],
    "correct": 1
  },
  {
    "text": "Tìm đáp án sai về giai cấp công nhân hiện nay?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân vẫn đang là lực lượng sản xuất hàng đầu",
      "B. Giai cấp công nhân vẫn bị giai cấp tư sản và chủ nghĩa tư bản bóc lột về giá trị thặng dư",
      "C. Xung đột về lợi ích cơ bản giữa giai cấp tư sản và giai cấp công nhân vẫn còn tồn tại",
      "D. Giai cấp công nhân hiện nay không bị bóc lột về giá trị thặng dư"
    ],
    "correct": 4
  },
  {
    "text": "Tìm nội dung không đúng về giai cấp công nhân hiện nay?",
    "type": "Multiple Choice",
    "options": [
      "A. Là lực lượng sản xuất hàng đầu của xã hội hiện đại",
      "B. Là giai cấp vẫn còn bị bóc lột về giá trị thặng dư",
      "C. Là giai cấp có trình độ sản xuất thấp",
      "D. Là giai cấp xung đột lợi ích với giai cấp tư sản"
    ],
    "correct": 3
  },
  {
    "text": "Điểm khác biệt cơ bản của giai cấp công nhân hiện nay và giai cấp công nhân trước đây là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân hiện nay có xu hướng trí tuệ hóa",
      "B. Giai cấp công nhân hiện nay bị bóc lột về giá trị thặng dư",
      "C. Giai cấp công nhân hiện nay xung đột lợi ích với giai cấp tư sản",
      "D. Giai cấp công nhân hiện nay bị hao phí lao động chủ yếu là hao phí sức lực cơ bắp"
    ],
    "correct": 1
  },
  {
    "text": "Nội dung kinh tế trong sứ mệnh lịch sử của giai cấp công nhân trên thế giới hiện nay là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Ở các nước tư bản chủ nghĩa, mục tiêu đấu tranh lâu dài của giai cấp công nhân là giành chính quyền",
      "B. Giai cấp công nhân tham gia trực tiếp vào quá trình sản xuất với công nghệ hiện đại, năng suất, chất lượng cao",
      "C. Thực hiện các giá trị như lao động, sáng tạo, công bằng, dân chủ, bình đẳng, tự do",
      "D. Đấu tranh bảo vệ nền tảng tư tưởng của Đảng cộng sản"
    ],
    "correct": 2
  },
  {
    "text": "Nội dung chính trị - xã hội trong sứ mệnh lịch sử của giai cấp công nhân trên thế giới hiện nay là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Ở các nước xã hội chủ nghĩa, giai cấp công nhân thực hiện thành công sự nghiệp đổi mới, giải quyết các nhiệm vụ trong thời kỳ quá độ lên chủ nghĩa xã hội",
      "B. Giai cấp công nhân tham gia trực tiếp vào quá trình sản xuất với công nghệ hiện đại, năng suất, chất lượng cao",
      "C. Thực hiện các giá trị như lao động, sáng tạo, công bằng, dân chủ, bình đẳng, tự do",
      "D. Đấu tranh bảo vệ nền tảng tư tưởng của Đảng cộng sản, củng cố niềm tin, lý tưởng xã hội chủ nghĩa"
    ],
    "correct": 1
  },
  {
    "text": "Chọn phương án đúng nhất: Sự ra đời và phát triển của giai cấp công nhân hiện đại gắn liền với sự ra đời và phát triển của:",
    "type": "Multiple Choice",
    "options": [
      "A. Sản xuất thủ công",
      "B. Công trường thủ công",
      "C. Nền đại công nghiệp tư bản chủ nghĩa",
      "D. Cả A, B, C đều sai"
    ],
    "correct": 3
  },
  {
    "text": "Nội dung sứ mệnh lịch sử của giai cấp công nhân là:",
    "type": "Multiple Choice",
    "options": [
      "A. Xóa bỏ chế độ chiếm hữu nô lệ, xây dựng chế độ phong kiến",
      "B. Xóa bỏ chế độ phong kiến, xây dựng chế độ tư bản chủ nghĩa",
      "C. Xóa bỏ chế độ tư bản chủ nghĩa, xây dựng chủ nghĩa xã hội, chủ nghĩa cộng sản",
      "D. Cả A, B, C đều sai"
    ],
    "correct": 3
  },
  {
    "text": "Giai cấp công nhân có nguồn gốc xuất thân từ những giai cấp, tầng lớp nào trong xã hội?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp nông dân.",
      "B. Thợ thủ công.",
      "C. Tiểu tư sản.",
      "D. Từ tất cả giai cấp, tầng lớp."
    ],
    "correct": 4
  },
  {
    "text": "Hoàn thành luận điểm của C. Mác và Ph. Ăngghen: “Tất cả các giai cấp khác đều suy tàn và tiêu vong cùng với sự phát triển của đại công nghiệp, còn giai cấp vô sản lại là (...) của bản thân nền đại công nghiệp” .",
    "type": "Multiple Choice",
    "options": [
      "A. Sản phẩm.",
      "B. Thành tựu.",
      "C. Kết quả.",
      "D. Chủ thể."
    ],
    "correct": 1
  },
  {
    "text": "Trong xã hội tư bản chủ nghĩa, địa vị xã hội của giai cấp công nhân biểu hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Là giai cấp thống trị và chiếm đoạt giá trị thặng dư.",
      "B. Giai cấp không có tư liệu sản xuất chủ yếu, phải bán sức lao động cho nhà tư bản và bị nhà tư bản bóc lột giá trị thặng dư.",
      "C. Giai cấp có tư liệu sản xuất nên làm chủ giá trị thặng dư.",
      "D. Giai cấp có lợi ích cơ bản thống nhất với lợi ích của giai cấp tư sản."
    ],
    "correct": 2
  },
  {
    "text": "Chọn cụm từ dưới đây để hoàn thành luận điểm sau: Trong chế độ tư bản chủ nghĩa, giai cấp công nhân có lợi ích cơ bản (...) với lợi ích của giai cấp tư sản.",
    "type": "Multiple Choice",
    "options": [
      "A. Thống nhất.",
      "B. Phù hợp.",
      "C. Đối lập trực tiếp.",
      "D. Đối lập gián tiếp."
    ],
    "correct": 3
  },
  {
    "text": "Sự khác nhau căn bản giữa giai cấp công nhân ở các nước tư bản chủ nghĩa và xã hội chủ nghĩa biểu hiện ở điều gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Phương thức lao động, phương thức sản xuất.",
      "B. Quan hệ sở hữu đối với tư liệu sản xuất chủ yếu của xã hội.",
      "C. Nguồn gốc xuất thân của giai cấp công nhân.",
      "D. Sản phẩm lao động của giai cấp công nhân."
    ],
    "correct": 2
  },
  {
    "text": "Giai cấp, tầng lớp nào đại diện cho lực lượng sản xuất tiên tiến trong chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân.",
      "B. Giai cấp tư sản.",
      "C. Giai cấp nông dân.",
      "D. Tầng lớp trí thức."
    ],
    "correct": 1
  },
  {
    "text": "Quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa là bỏ qua yếu tố nào của chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. Bỏ qua nhà nước của giai cấp tư sản.",
      "B. Bỏ qua cơ sở kinh tế của chủ nghĩa tư bản.",
      "C. Bỏ qua việc xác lập vị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư tưởng tư bản chủ nghĩa.",
      "D. Bỏ qua chế độ áp bức bóc lột của giai cấp tư sản"
    ],
    "correct": 3
  },
  {
    "text": "Thời kỳ quá độ lên chủ nghĩa xã hội ở trên phạm vi cả nước ta bắt đầu từ khi nào?",
    "type": "Multiple Choice",
    "options": [
      "A. 1945",
      "B. 1954",
      "C. 1975",
      "D. 1930"
    ],
    "correct": 3
  },
  {
    "text": "Xã hội xã hội chủ nghĩa mà nhân dân ta xây dựng có mấy đặc trưng?",
    "type": "Multiple Choice",
    "options": [
      "A. 5",
      "B. 6",
      "C. 7",
      "D. 8"
    ],
    "correct": 4
  },
  {
    "text": "Cương lĩnh xây dựng đất nước trong thời kỳ quá độ lên chủ nghĩa xã hội được Đảng ta nêu ra ở Đại hội nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Đại hội IV",
      "B. Đại hội VI",
      "C. Đại hội VII",
      "D. Đại hội VIII"
    ],
    "correct": 3
  },
  {
    "text": "Trong Văn kiện Đại hội IX, Đảng ta xác định phải tiếp thu và kế thừa những gì của chủ nghĩa tư bản trong thời kỳ quá độ lên chủ nghĩa xã hội ở Việt Nam?",
    "type": "Multiple Choice",
    "options": [
      "A. Tiếp thu, kế thừa những thành tựu mà nhân loại đã đạt được dưới chế độ tư bản chủ nghĩa, đặc biệt về khoa học và công nghệ, để phát triển nhanh lực lượng sản xuất, xây dựng nền kinh tế hiện đại.",
      "B. Tiếp thu, kế thừa mô hình quản lý kinh tế - xã hội và thành tựu khoa học công nghệ.",
      "C. Tiếp thu, kế thừa những giá trị kinh tế, chính trị, văn hoá - xã hội và pháp luật trong chủ nghĩa tư bản.",
      "D. Cả ba đều sai."
    ],
    "correct": 1
  },
  {
    "text": "Theo chủ nghĩa Mác – Lênin có mấy loại quá độ lên chủ nghĩa cộng sản?",
    "type": "Multiple Choice",
    "options": [
      "A. 3",
      "B. 2",
      "C. 4",
      "D. 1"
    ],
    "correct": 2
  },
  {
    "text": "Quá độ lên chủ nghĩa xã hội ở Việt Nam là loại quá độ nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Quá độ trực tiếp, từ chủ nghĩa tư bản lên chủ nghĩa xã hội.",
      "B. Quá độ gián tiếp, bỏ qua chê độ chủ nghĩa tư bản tiến lên chủ nghĩa xã hội.",
      "C. Quá độ gián tiếp, bỏ qua chế độ phong kiến tiến lên chủ nghĩa xã hội",
      "D. Quá độ có qua trung gian"
    ],
    "correct": 2
  },
  {
    "text": "Về nội dung, thời kì quá độ lên chủ nghĩa xã hội là thời kì cải tạo cách mạng sâu sắc, triệt để xã hội tư bản chủ nghĩa trên các lĩnh vực:",
    "type": "Multiple Choice",
    "options": [
      "A. Kinh tế, chính trị",
      "B. Kinh tế, văn hóa, xã hội",
      "C. Kinh tế, chính trị, văn hóa, xã hội",
      "D. Chủ yếu là chính trị."
    ],
    "correct": 3
  },
  {
    "text": "Một trong những phương hướng phản ánh con đường đi lên chủ nghĩa xã hội ở nước ta đó là:",
    "type": "Multiple Choice",
    "options": [
      "A. Xây dựng nền dân chủ xã hội chủ nghĩa, thực hiện đại đoàn kết toàn dân tộc, tăng cường và mở rộng mặt trận dân tộc thống nhất.",
      "B. Phát triển nền kinh tế thị trường",
      "C. Cả a và b đều đúng",
      "D. Cả a, b, c đều sai"
    ],
    "correct": 1
  },
  {
    "text": "Một trong những điều kiện kinh tế - xã hội dẫn tới sự sụp đổ không tránh khỏi của chủ nghĩa tư bản đó là sự phát triển về lực lượng sản xuất và sự trưởng thành của giai cấp công nhân.",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Một trong những đặc trưng cơ bản của giai đoạn đầu (giai đoạn thấp) của xã hội cộng sản là chỉ giải phóng giai cấp vô sản.",
    "type": "Multiple Choice",
    "options": [
      "A. Sai",
      "B. Đúng"
    ],
    "correct": 1
  },
  {
    "text": "Chủ nghĩa xã hội có nhà nước kiểu mới mang bản chất của giai cấp công nhân, đại biểu cho lợi ích, quyền lực và ý chí của giai cấp công nhân.",
    "type": "Multiple Choice",
    "options": [
      "A. Sai",
      "B. Đúng"
    ],
    "correct": 1
  },
  {
    "text": "Quá độ lên chủ nghĩa xã hội bỏ qua chế độ tư bản chủ nghĩa ở Việt Nam là bỏ qua tất cả các mặt, các lĩnh vực liên quan đến chủ nghĩa tư bản.",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 2
  },
  {
    "text": "V.I.Lênin cho rằng, đối với những nước chưa có chủ nghĩa tư bản phát triển cao “cần phải có thời kỳ quá độ….từ chủ nghĩa tư bản lên chủ nghĩa xã hội”",
    "type": "Multiple Choice",
    "options": [
      "A. Đa dạng, phức tạp",
      "B. Khá lâu dài",
      "C. Trung bình",
      "D. Khó khăn"
    ],
    "correct": 2
  },
  {
    "text": "Theo C.Mác: Xã hội của thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội có đặc điểm:",
    "type": "Multiple Choice",
    "options": [
      "A. Là một xã hội cộng sản chủ nghĩa đã phát triển ở giai đoạn cao",
      "B. Vẫn đang là một xã hội tư bản chủ nghĩa với những đặc trưng cơ bản của nó.",
      "C. Là một xã hội mà ở đó con người làm theo năng lực hưởng theo nhu cầu.",
      "D. Là một xã hội cộng sản chủ nghĩa vừa thoát thai từ xã hội tư bản chủ nghĩa nên mang dấu vết của xã hội cũ mà nó đã lọt lòng ra."
    ],
    "correct": 4
  },
  {
    "text": "Thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội vẫn mang dấu vết về kinh tế, đạo đức, chính trị của xã hội tư bản chủ nghĩa bởi vì đó là:",
    "type": "Multiple Choice",
    "options": [
      "A. Là xã hội thấp hơn xã hội tư bản chủ nghĩa",
      "B. Là xã hội cộng sản phát triển ở đỉnh cao",
      "C. Là một xã hội cộng sản chủ nghĩa vừa thoát thai từ xã hội tư bản chủ nghĩa",
      "D. Là một xã hội đã phủ định sạch trơn xã hội TBCN"
    ],
    "correct": 3
  },
  {
    "text": "Tìm đáp án đúng nhất, V.I.Lênin cho rằng thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa cộng sản như “những cơn đau đẻ kéo dài” dùng để chỉ thời kỳ quá độ:",
    "type": "Multiple Choice",
    "options": [
      "A. Đối với các nước chưa trải qua chủ nghĩa tư bản phát triển",
      "B. Đối với các nước đã trải qua chủ nghĩa tư bản phát triển",
      "C. Đối với các nước các nước tư bản hiện đại",
      "D. Đối với các nước tư bản đã tiến hành xong cuộc cách mạng công nghiệp."
    ],
    "correct": 1
  },
  {
    "text": "Theo chủ nghĩa Mác - Lênin, sự thay thế hình thái kinh tế - xã hội tư bản chủ nghĩa bằng hình thái kinh tế - xã hội cộng sản chủ nghĩa xuất phát từ hai tiền đề vật chất quan trọng nhất, đó là:",
    "type": "Multiple Choice",
    "options": [
      "A. Sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp công nhân",
      "B. Sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp tư sản",
      "C. Sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp nông dân",
      "D. Sự phát triển của lực lượng sản xuất và sự trưởng thành của giai cấp nông dân, giai cấp tư sản"
    ],
    "correct": 1
  },
  {
    "text": "Mâu thuẫn kinh tế cơ bản của chủ nghĩa tư bản là:",
    "type": "Multiple Choice",
    "options": [
      "A. Mâu thuẫn giữa tính chất cá nhân của lực lượng sản xuất và chế độ công hữu về tư liệu sản xuất",
      "B. Mâu thuẫn giữa tính chất xã hội hóa của lực lượng sản xuất với chế độ chiếm hữu tư nhân tư bản chủ nghĩa đối với tư liệu sản xuất",
      "C. Mâu thuẫn giữa tính chất xã hội hóa của lực lượng sản xuất với chế độ công hữu về tư liệu sản xuất",
      "D. Mâu thuẫn giữa tính chất cá nhân của lực lượng sản xuất với chế độ tư hữu về tư liệu sản xuất"
    ],
    "correct": 2
  },
  {
    "text": "Trong chủ nghĩa tư bản, mâu thuẫn kinh tế cơ bản biểu hiện thành mâu thuẫn về mặt xã hội là:",
    "type": "Multiple Choice",
    "options": [
      "A. Mâu thuẫn giữa giai cấp công nhân hiện đại với giai cấp tư sản lỗi thời",
      "B. Mâu thuẫn giữa giai cấp công nhân hiện đại với giai cấp nông dân",
      "C. Mâu thuẫn giữa giai cấp tư sản hiện đại với giai cấp nông dân",
      "D. Mâu thuẫn giữa công nhân hiện đại với nhân dân lao động"
    ],
    "correct": 1
  },
  {
    "text": "Bàn luận về việc thay đổi từ chế độ tư bản chủ nghĩa sang chế độ cộng sản chủ nghĩa, C.Mác và Ph.Ăngghen cho rằng: “Giai cấp tư sản không chỉ tạo vũ khí để giết mình mà còn tạo ra những người sử dụng vũ khí đó” chính là:",
    "type": "Multiple Choice",
    "options": [
      "A. Những người nông dân",
      "B. Những người công nhân hiện đại, những người vô sản",
      "C. Những người thuộc về tầng lớp quý tộc",
      "D. Những lao động nghèo trong xã hội"
    ],
    "correct": 2
  },
  {
    "text": "Điền vào chỗ trống: “Trong vòng chưa đầy một thế kỷ, … đã tạo ra được một lực lượng sản xuất nhiều hơn và đồ sộ hơn lực lượng sản xuất mà nhân loại tạo ra đến lúc đó”",
    "type": "Fill-in-the-Blank",
    "correct": "Chủ nghĩa tư bản"
  },
  {
    "text": "Sự trưởng thành vượt bậc và thực sự của giai cấp công nhân được đánh dấu bằng sự ra đời của:",
    "type": "Multiple Choice",
    "options": [
      "A. Nhà nước",
      "B. Các tổ chức chính trị- xã hội",
      "C. Đảng cộng sản",
      "D. Nhà nước và các tổ chức chính trị - xã hội"
    ],
    "correct": 3
  },
  {
    "text": "Sự ra đời của Đảng Cộng sản đánh dấu sự trưởng thành vượt bậc và thực sự của:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân",
      "B. Giai cấp nông dân",
      "C. Giai cấp tư sản",
      "D. Tầng lớp trí thức"
    ],
    "correct": 1
  },
  {
    "text": "Hình thái kinh tế - xã hội cộng sản chủ nghĩa không tự nhiên ra đời mà trái lại, nó chỉ được thông qua cách mạng vô sản dưới sự lãnh đạo của:",
    "type": "Multiple Choice",
    "options": [
      "A. Đảng Cộng sản",
      "B. Nhà nước",
      "C. Các tổ chức chính trị- xã hội",
      "D. Đảng của giai cấp tư sản"
    ],
    "correct": 1
  },
  {
    "text": "Theo C.Mác, nhà nước của thời kỳ quá độ từ chủ nghĩa tư bản lên chủ nghĩa xã hội là:",
    "type": "Multiple Choice",
    "options": [
      "A. Nền chuyên chính cách mạng của giai cấp vô sản",
      "B. Nền chuyên chính của giai cấp tư sản",
      "C. Nền chuyên chính tư sản",
      "D. Tất cả các đáp án"
    ],
    "correct": 1
  },
  {
    "text": "Chủ nghĩa xã hội là:",
    "type": "Multiple Choice",
    "options": [
      "A. Là phong trào đấu tranh của nhân dân lao động chống lại áp bức, bất công",
      "B. Là lý luận phản ánh lý tưởng giải phóng nhân dân lao động khỏi áp bức, bất công đồng thời là môn khoa học về sứ mệnh lịch sử của giai cấp công nhân",
      "C. Là một chế độ xã hội tốt đẹp, giai đoạn đầu của hình thái kinh tế- xã hội cộng sản chủ nghĩa",
      "D. Tất cả các đáp án trên"
    ],
    "correct": 4
  },
  {
    "text": "Cách mạng vô sản chỉ có thể thành công, hình thái kinh tế - xã hội cộng sản chủ nghĩa chỉ có thể được thiết lập khi:",
    "type": "Multiple Choice",
    "options": [
      "A. Có sự liên minh giữa giai cấp công nhân với các giai cấp và tầng lớp những người lao động dưới sự lãnh đạo của Đảng Cộng sản.",
      "B. Có sự liên minh giữa giai cấp công nhân với giai cấp tư sản dưới sự lãnh đạo của Đảng cộng sản.",
      "C. Chỉ có sự liên minh giữa giai cấp nông dân với giai cấp tư sản.",
      "D. Chỉ có giai cấp công nhân làm cách mạng dưới sự lãnh đạo của Đảng Cộng sản."
    ],
    "correct": 1
  },
  {
    "text": "Thực tế, cuộc cách mạng vô sản nhằm lật đổ chế độ tư bản chủ nghĩa, thiết lập nhà nước chuyên chính vô sản, xây dựng xã hội mới, xã hội chủ nghĩa và xã hội cộng sản được thực hiện bởi:",
    "type": "Multiple Choice",
    "options": [
      "A. Con đường bạo lực cách mạng.",
      "B. Con đường hòa bình.",
      "C. Con đường hợp tác",
      "D. Con đường ngoại giao"
    ],
    "correct": 1
  },
  {
    "text": "Giải phóng giai cấp, giải phóng dân tộc, giải phóng xã hội, giải phóng con người, tạo điều kiện để con người phát triển toàn diện là:",
    "type": "Multiple Choice",
    "options": [
      "A. Nội dung trọng tâm của chủ nghĩa tư bản",
      "B. Nội dung trọng tâm của chế độ phong kiến",
      "C. Là sự khác biệt về chất giữa hình thái kinh tế - xã hội cộng sản chủ nghĩa so với các hình thái kinh tế - xã hội ra đời trước đó",
      "D. Là điểm tương đồng về chất giữa hình thái kinh tế - xã hội cộng sản chủ nghĩa so với các hình thái kinh tế - xã hội ra đời trước đó"
    ],
    "correct": 3
  },
  {
    "text": "Theo V.I.Lênin, mục đích cao nhất, cuối cùng của những cải tạo xã hội chủ nghĩa là thực hiện nguyên tắc:",
    "type": "Multiple Choice",
    "options": [
      "A. Làm theo năng lực, hưởng theo nhu cầu",
      "B. Làm theo năng lực, hưởng theo lao động",
      "C. Không làm cũng được hưởng",
      "D. Bình quân chủ nghĩa"
    ],
    "correct": 1
  },
  {
    "text": "Chủ nghĩa xã hội là:",
    "type": "Multiple Choice",
    "options": [
      "A. Xã hội do giai cấp tư sản làm chủ",
      "B. Xã hội do nhân dân lao động làm chủ",
      "C. Xã hội dựa trên chế độ tư hữu về tư liệu sản xuất",
      "D. Xã hội phục vụ lợi ích cho thiểu số"
    ],
    "correct": 2
  },
  {
    "text": "Theo V.I.Lênin, từ thực tiễn xây dựng chủ nghĩa xã hội ở nước Nga Xô viết đã coi chính quyền Xô viết là kiểu nhà nước:",
    "type": "Multiple Choice",
    "options": [
      "A. Có nền dân chủ tư sản",
      "B. Số ít đàn áp số đông",
      "C. Có chế độ dân chủ ưu việt gấp triệu lần so với chế độ dân chủ tư sản",
      "D. Tất cả các đáp án"
    ],
    "correct": 3
  },
  {
    "text": "Đặc trưng về phương diện kinh tế của chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Có nền kinh tế phát triển cao dựa trên lực lượng sản xuất hiện đại và chế độ tư hữu về tư liệu sản xuất",
      "B. Có nền kinh tế chậm phát triển dựa trên chế độ công hữu về tư liệu sản xuất",
      "C. Có nền kinh tế phát triển cao dựa trên lực lượng sản xuất hiện đại và chế độ công hữu về tư liệu sản xuất",
      "D. Có nền kinh tế phát triển cao với chế chệ độ tư hữu về tư liệu sản xuất Đặc trưng của chủ nghĩa xã hội:"
    ],
    "correct": 3
  },
  {
    "text": "Đặc trưng của chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A.Quyền dân chủ thuộc về thiểu số",
      "B. Nhân dân lao động là chủ thể của xã hội thực hiện quyền làm chủ",
      "C. Quyền lực do một nhóm người nắm giữ",
      "D. Tất cả các đáp án trên"
    ],
    "correct": 2
  },
  {
    "text": "Theo Ph.Ăngghen: Trong giai đoạn đầu của xã hội cộng sản chủ nghĩa:",
    "type": "Multiple Choice",
    "options": [
      "A. Ngay lập tức thủ tiêu chế độ công hữu về tư liệu sản xuất",
      "B. Không thể làm cho lực lượng sản xuất hiện có tăng lên ngay lập tức đến mức cần thiết để xây dựng nền kinh tế công hữu",
      "C. Đáp ứng đầy đủ mọi yêu cầu về đời sống vật chất và tinh thần cho nhân dân lao động",
      "D. Không còn Nhà nước"
    ],
    "correct": 2
  },
  {
    "text": "Một trong những đặc trưng cơ bản của chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Có nhà nước kiểu mới mang bản chất giai cấp tư sản.",
      "B. Có nhà nước kiểu mới mang bản chất giai cấp công nhân, đại biểu cho lợi ích, quyền lực và ý chí của nhân dân lao động",
      "D. Không còn Nhà nước."
    ],
    "correct": 2
  },
  {
    "text": "Đặc trưng của nền văn hóa trong chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Nền văn hóa phi vô sản",
      "B. Nền văn hóa phục vụ cho lợi ích của thiểu số",
      "C. Nền văn hóa dựa trên nền tảng tư tưởng của giai cấp tư sản",
      "D. Nền văn hóa vô sản, phát triển cao, kế thừa và phát huy những giá trị của văn hóa dân tộc và tinh hoa văn hóa nhân loại"
    ],
    "correct": 4
  },
  {
    "text": "Tìm đáp án sai:",
    "type": "Multiple Choice",
    "options": [
      "A. Quá độ trực tiếp là từ chủ nghĩa tư bản lên chủ nghĩa cộng sản đối với những nước trải qua chủ nghĩa tư bản phát triển",
      "B. Quá độ gián tiếp từ chủ nghĩa tư bản lên chủ nghĩa cộng sản đối với những nước chưa trải qua chủ nghĩa tư bản phát triển",
      "C. Trong bối cảnh toàn cầu hóa và cuộc cách mạng công nghiệp 4.0, các nước lạc hậu vẫn không thể tiến thẳng lên chủ nghĩa xã hội",
      "D. Các nước lạc hậu với sự giúp đỡ của giai cấp vô sản đã chiến thắng có thể rút ngắn được quá trình phát triển của mình lên chủ nghĩa xã hội"
    ],
    "correct": 1
  },
  {
    "text": "Về lĩnh vực kinh tế của thời kỳ quá độ lên chủ nghĩa xã hội, luận điểm nào sau đây là đúng?",
    "type": "Multiple Choice",
    "options": [
      "A. Thành phần kinh tế có vốn đầu tư nước ngoài là chủ đạo",
      "B. Tất yếu tồn tại nền kinh tế nhiều thành phần",
      "C. Thành phần kinh tế tư nhân tư bản giữ vai trò chủ đạo",
      "D. Chỉ có những thành phần kinh tế với quy mô lớn"
    ],
    "correct": 2
  },
  {
    "text": "Tìm đáp án SAI:Về lĩnh vực chính trị của thời kỳ quá độ:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân nắm và sử dụng quyền lực nhà nước trấn áp giai cấp tư sản, tiến hành xây dựng một xã hội không giai cấp",
      "B. Thực hiện quyền dân chủ đối với nhân dân",
      "C. Giai cấp công nhân thỏa hiệp, đồng lòng với giai cấp tư sản",
      "D. Thực hiện chuyên chính với những phần tử thù địch, chống lại nhân dân"
    ],
    "correct": 3
  },
  {
    "text": "Tìm đáp án SAI: Trên lĩnh vực xã hội của thời kỳ quá độ lên chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Còn tồn tại nhiều giai cấp, tầng lớp xã hội khác nhau",
      "B. Còn tồn tại sự khác biệt giữa nông thôn và thành thị, giữa lao động trí óc và lao động chân tay",
      "C. Là thời kỳ đấu tranh giai cấp chống áp bức, bất công, xóa bỏ tệ nạn xã hội và những tàn dư của xã hội cũ để lại",
      "D. Thực hiện nguyên tắc phân phối theo nhu cầu là chủ đạo"
    ],
    "correct": 4
  },
  {
    "text": "Đặc điểm cơ bản của Việt Nam khi tiến lên xây dựng chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Xuất phát từ một xã hội vốn là thuộc địa, nửa phong kiến, lực lượng sản xuất rất thấp",
      "B. Xuất phát từ một xã hội có lực lượng sản xuất phát triển cao",
      "C. Xuất phát từ một nước tư bản kém phát triển",
      "D. Xuất phát từ một nước tư bản đã phát triển"
    ],
    "correct": 1
  },
  {
    "text": "Những thuận lợi của Việt Nam khi tiến lên xây dựng chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Xuất phát từ một nước vốn là thuộc địa, nửa phong kiến, lực lượng sản xuất rất thấp",
      "B. Kế thừa được những thành tựu của cuộc cách mạng khoa học và công nghệ hiện đại",
      "C. Sự sụp đổ của chế độ xã hội chủ nghĩa ở Liên Xô và Đông Âu vào những năm 90 của thế kỷ XX",
      "D. Âm mưu chống phá sự nghiệp xây dựng chủ nghĩa xã hội ở Việt Nam của các nước thù địch"
    ],
    "correct": 2
  },
  {
    "text": "Nguyên nhân sâu xa dẫn đến sự thay thế hình thái kinh tế - xã hội tư bản chủ nghĩa bằng hình thái kinh tế - xã hội cộng sản chủ nghĩa là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Mâu thuẫn giữa tư liệu lao động với đối tượng lao động trong nền sản xuất hàng hóa tư bản chủ nghĩa.",
      "B. Mâu thuẫn giữa lực lượng sản xuất mang tính xã hội hóa ngày càng cao với quan hệ sản xuất tư bản chủ nghĩa dựa trên chế độ chiếm hữu tư nhân tư bản chủ nghĩa về tư liệu sản xuất chủ yếu.",
      "C. Mâu thuẫn giữa phương thức sản xuất cộng sản chủ nghĩa với phương thức sản xuất tư bản chủ nghĩa.",
      "D. Mâu thuẫn giữa các giai cấp, tầng lớp lao động trong xã hội."
    ],
    "correct": 2
  },
  {
    "text": "Tiêu chí nào là quan trọng nhất để C. Mác phân chia hai giai đoạn phát triển của hình thái kinh tế - xã hội cộng sản chủ nghĩa?",
    "type": "Multiple Choice",
    "options": [
      "A. Ý thức giác ngộ của nhân dân lao động.",
      "B. Trình độ quản lý của Nhà nước.",
      "C. Trình độ xã hội hóa của lực lượng sản xuất.",
      "D. Trình độ dân trí của xã hội."
    ],
    "correct": 2
  },
  {
    "text": "Trong các dự báo sau đây của C. Mác và Ph. Ăngghen, dự báo nào thuộc giai đoạn thấp của hình thái kinh tế - xã hội cộng sản chủ nghĩa?",
    "type": "Multiple Choice",
    "options": [
      "A. Sự đối lập giữa lao động trí óc và lao động chân tay không còn.",
      "B. Không còn sự phân chia giai cấp.",
      "C. Mọi người làm hết năng lực, hưởng theo nhu cầu.",
      "D. Mọi người làm theo năng lực, hưởng theo lao động, vẫn còn pháp quyền tư sản."
    ],
    "correct": 4
  },
  {
    "text": "Tiền đề vật chất cho sự ra đời của chủ nghĩa xã hội là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là điện khí hóa nền sản xuất.",
      "B. Là tự động hóa nền sản xuất.",
      "C. Là tin học hóa nền sản xuất.",
      "D. Là xã hội hóa lực lượng sản xuất."
    ],
    "correct": 4
  },
  {
    "text": "Câu 8. Chỉ ra luận điểm chính xác nhất?",
    "type": "Multiple Choice",
    "options": [
      "A. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ chế độ tư hữu phong kiến.",
      "B. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ sản xuất hàng hóa.",
      "C. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ sản xuất tự cấp tự túc.",
      "D. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ chế độ tư hữu tư bản."
    ],
    "correct": 4
  },
  {
    "text": "Chỉ ra luận điểm không chính xác?",
    "type": "Multiple Choice",
    "options": [
      "A. Giữa xã hội tư bản chủ nghĩa và xã hội xã hội chủ nghĩa là thời kỳ cải biến cách mạng lâu dài và phức tạp.",
      "B. Nhà nước trong thời kỳ quá độ lên chủ nghĩa xã hội là nền chuyên chính cách mạng của giai cấp công nhân.",
      "C. Trong thời kỳ quá độ có thể và cần thủ tiêu mọi tàn tích của chủ nghĩa tư bản.",
      "D. Thời kỳ quá độ lên chủ nghĩa xã hội còn tồn tại nhiều tư tưởng - văn hóa cũ và mới đan xen, đấu tranh lẫn nhau."
    ],
    "correct": 3
  },
  {
    "text": "Đặc điểm chủ yếu của thời kỳ quá độ lên chủ nghĩa xã hội là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Chính quyền của giai cấp lao động được thành lập. Nhân dân lao động hoàn toàn làm chủ xã hội.",
      "B. Hệ tư tưởng chính trị của giai cấp công nhân là hệ tư tưởng duy nhất tồn tại trong xã hội. Giai cấp công nhân là chủ thể toàn bộ giá trị văn hóa tinh thần của xã hội.",
      "C. Tồn tại đan xen và đấu tranh lẫn nhau giữa những nhân tố của xã hội mới và những tàn dư của xã hội cũ trên mọi lĩnh vực của đời sống xã hội.",
      "D. Tồn tại kinh tế thị trường định hướng xã hội chủ nghĩa, ở đó, các chủ thể kinh tế đều chịu sự chi phối của quy luật thị trường"
    ],
    "correct": 3
  },
  {
    "text": "Đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội trên lĩnh vực kinh tế là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Còn tồn tại nhiều hệ tư tưởng khác nhau.",
      "B. Còn tồn tại nhiều thành phần kinh tế khác nhau.",
      "C. Còn tồn tại giai cấp đối kháng và đấu tranh giai cấp.",
      "D. Còn tồn tại nhiều tàn dư của chế độ cũ để lại."
    ],
    "correct": 2
  },
  {
    "text": "Đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội trên lĩnh vực chính trị là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Còn tồn tại nhiều hình thức sở hữu khác nhau.",
      "B. Còn tồn tại nhiều thành phần kinh tế khác nhau.",
      "C. Còn tồn tại giai cấp đối kháng và đấu tranh giai cấp.",
      "D. Còn tồn tại tàn dư tư tưởng và văn hóa của chế độ cũ để lại."
    ],
    "correct": 3
  },
  {
    "text": "Đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội trên lĩnh vực tư tưởng - văn hóa là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Còn tồn tại nhiều hình thức sở hữu khác nhau.",
      "B. Còn tồn tại nhiều thành phần kinh tế khác nhau.",
      "C. Còn tồn tại giai cấp đối kháng và đấu tranh giai cấp.",
      "D. Còn tồn tại nhiều tư tưởng - văn hóa cũ và mới đan xen, đấu tranh lẫn nhau."
    ],
    "correct": 4
  },
  {
    "text": "Có ý kiến cho rằng: Dân chủ vô sản không phải là chế độ dân chủ cho tất cả mọi người; nó chỉ là dân chủ đối với quần chúng lao động và bị bóc lột; dân chủ vô sản là chế độ dân chủ vì lợi ích của đa số.",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Có ý kiến cho rằng: Cũng giống như nền dân chủ tư sản, bản chất kinh tế của nền dân chủ xã hội chủ nghĩa là thực hiện chế độ tư hữu về tư liệu sản xuất chủ yếu.",
    "type": "Multiple Choice",
    "options": [
      "A. Sai",
      "B. Đúng"
    ],
    "correct": 1
  },
  {
    "text": "Với tư cách là một hình thái nhà nước, một chế độ chính trị thì trong lịch sử nhân loại, cho đến nay có 5 nền dân chủ: Dân chủ công xã nguyên thủy; dân chủ chiếm hữu nô lệ, dân chủ phong kiến; dân chủ tư sản; dân chủ xã hội chủ nghĩa.",
    "type": "Multiple Choice",
    "options": [
      "A. Sai",
      "B. Đúng"
    ],
    "correct": 2
  },
  {
    "text": "Theo nguyên nghĩa tiếng Hy lạp thì “Dân chủ” là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là quyền lực thuộc về nhân dân",
      "B. Là quyền tự do của mỗi người",
      "C. Là quyền của con người",
      "D. Là trật tự xã hội"
    ],
    "correct": 1
  },
  {
    "text": "Chế độ dân chủ nhân dân ở Việt Nam được xác lập khi nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Từ chiến thắng Điện Biên Phủ",
      "B. Từ chiến thắng 30/4/1975",
      "C. Từ Cách mạng tháng 8/1945",
      "D. Cả A, B, C đều đúng"
    ],
    "correct": 3
  },
  {
    "text": "“Dân chủ nguyên thủy” hay “Dân chủ quân sự” tồn tại trong chế độ nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Công xã nguyên thủy",
      "B. Chiếm hữu nô lệ",
      "C. Phong kiến",
      "D. Tư bản chủ nghĩa"
    ],
    "correct": 1
  },
  {
    "text": "Chọn đáp án đúng cho nhận định: “Nền dân chủ tư bản chủ nghĩa là nền dân chủ dành cho đa số”",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai",
      "C. Chỉ dành cho giai cấp công nhân",
      "D. Cả B, C đều đúng"
    ],
    "correct": 2
  },
  {
    "text": "Nền dân chủ xã hội chủ nghĩa chính thức được xác lập từ khi nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Từ thực tiễn đấu tranh giai cấp ở Pháp và Công xã Pari năm 1871",
      "B. Từ Cách mạng Tháng Mười Nga năm 1917",
      "C. Cả A và B đều đúng",
      "D. Cả A và B đều sai"
    ],
    "correct": 3
  },
  {
    "text": "Nền dân chủ xã hội chủ nghĩa dựa trên chế độ:",
    "type": "Multiple Choice",
    "options": [
      "A. Tư hữu về tư liệu sản xuất chủ yếu",
      "B. Công hữu về tư liệu sản xuất chủ yếu",
      "C. Cả A và B đều đúng",
      "D. Cả A và B đều sai"
    ],
    "correct": 2
  },
  {
    "text": "Nền dân chủ xã hội chủ nghĩa dựa trên hệ tư tưởng của giai cấp nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp phong kiến",
      "B. Giai cấp chủ nô",
      "C. Giai cấp công nhân",
      "D. Giai cấp tư sản"
    ],
    "correct": 3
  },
  {
    "text": "Bản chất chính trị của nền dân chủ xã hội chủ nghĩa thể hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Là sự lãnh đạo của giai cấp công nhân thông qua đảng của nó đối với toàn xã hội, để thực hiện quyền lực và lợi ích của toàn thể nhân dân lao động, trong đó có giai cấp công nhân.",
      "B. Là thực hiện quyền lực của giai cấp công nhân và nhân dân lao động đối với toàn xã hội.",
      "C. Cả A và B đều đúng",
      "D. Cả A và B đều sai"
    ],
    "correct": 3
  },
  {
    "text": "So với các nền dân chủ trước đây, dân chủ xã hội chủ nghĩa có điểm khác biệt cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Không còn mang tính giai cấp",
      "B. Là nền dân chủ phi lịch sử",
      "C. Là nền dân chủ thuần túy",
      "D. Là nền dân chủ rộng rãi cho giai cấp công nhân và nhân dân lao động"
    ],
    "correct": 4
  },
  {
    "text": "Điền từ còn thiếu vào chỗ trống: Nhà nước xã hội chủ nghĩa vừa có bản chất giai cấp công nhân, vừa có tính nhân dân rộng rãi và tính….. sâu sắc.",
    "type": "Fill-in-the-Blank",
    "correct": "Dân tộc"
  },
  {
    "text": "Bản chất kinh tế của nhà nước xã hội chủ nghĩa là:",
    "type": "Multiple Choice",
    "options": [
      "A. Dựa trên chế độ tư hữu về tư liệu sản xuất chủ yếu",
      "B. Dựa trên chế độ công hữu về tư liệu sản xuất chủ yếu",
      "C. Cả A và B đều đúng",
      "D. Cả A và B đều sai"
    ],
    "correct": 2
  },
  {
    "text": "Nền tảng lý luận của nhà nước xã hội chủ nghĩa là:",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa Mác – Lênin",
      "B. Tư tưởng Hồ Chí Minh",
      "C. Chủ nghĩa Mác – Lênin và tư tưởng Hồ Chí Minh",
      "D. Tư tưởng Mao Trạch Đông"
    ],
    "correct": 3
  },
  {
    "text": "Mối quan hệ giữa dân chủ xã hội chủ nghĩa và nhà nước xã hội chủ nghĩa là:",
    "type": "Multiple Choice",
    "options": [
      "A. Dân chủ XHCN là cơ sở, nền tảng cho việc xây dựng và hoạt động của nhà nước XHCN.",
      "B. Nhà nước XHCN là công cụ để thực hiện nền dân chủ XHCN.",
      "C. Cả A và B đều đúng",
      "D. Cả A và B đều sai"
    ],
    "correct": 3
  },
  {
    "text": "Trong các dự báo sau đây của C.Mác và Ph.Ăngghen, dự báo nào thuộc giai đoạn thấp của hình thái kinh tế - xã hội cộng sản chủ nghĩa?",
    "type": "Multiple Choice",
    "options": [
      "A. Sự đối lập giữa lao động trí óc và lao động chân tay không còn.",
      "B. Không còn sự phân chia giai cấp.",
      "C. Mọi người làm hết năng lực, hưởng theo nhu cầu.",
      "D. Mọi người làm theo năng lực, hưởng theo lao động, vẫn còn pháp quyền tư sản."
    ],
    "correct": 4
  },
  {
    "text": "Trong các dự báo của C.Mác, dự báo nào thuộc giai đoạn cao của hình thái kinh tế xã hội cộng sản chủ nghĩa?",
    "type": "Multiple Choice",
    "options": [
      "A. Xã hội chưa thoát khỏi tàn tích của chủ nghĩa tư bản",
      "B. Xã hội vẫn còn sự phân chia giai cấp đối kháng, trong đó giai cấp công nhân là giai cấp thống trị xã hội.",
      "C. Sự phát triển tự do của mỗi người là điều kiện cho sự phát triển tự do của mọi người",
      "D. Vẫn còn sự tồn tại kết cấu kinh tế của chủ nghĩa tư bản bên cạnh kết cấu kinh tế của chủ nghĩa xã hội."
    ],
    "correct": 3
  },
  {
    "text": "Tiền đề vật chất cho sự ra đời của chủ nghĩa xã hội là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là điện khí hóa nền sản xuất",
      "B. Là tự động hóa nền sản xuất",
      "C. Là tin học hóa nền sản xuất",
      "D. Là xã hội hóa lực lượng sản xuất"
    ],
    "correct": 4
  },
  {
    "text": "Chỉ ra luận điểm chính xác?",
    "type": "Multiple Choice",
    "options": [
      "A. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ chế độ tư hữu phong kiến",
      "B. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ sản xuất hàng hóa",
      "C. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ sản xuất tự cấp tự túc",
      "D. Xã hội xã hội chủ nghĩa thực hiện xóa bỏ chế độ tư hữu tư bản"
    ],
    "correct": 4
  },
  {
    "text": "Chỉ ra luận điểm không chính xác?",
    "type": "Multiple Choice",
    "options": [
      "A. Giữa xã hội tư bản chủ nghĩa và xã hội xã hội chủ nghĩa là thời kỳ cải biến cách mạng lâu dài và phức tạp",
      "B. Nhà nước trong thời kỳ quá độ lên chủ nghĩa xã hội là nền chuyên chính cách mạng của giai cấp công nhân",
      "C. Trong thời kỳ quá độ có thể và cần thủ tiêu mọi tàn tích của chủ nghĩa tư bản",
      "D. Thời kỳ quá độ lên chủ nghĩa xã hội còn tồn tại nhiều tư tưởng – văn hóa cũ và mới đan xen, đấu tranh lẫn nhau."
    ],
    "correct": 3
  },
  {
    "text": "Đặc điểm chủ yếu của thời kỳ quá độ lên chủ nghĩa xã hội là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Chính quyền của giai cấp lao động được thành lập. Nhân dân lao động hoàn toàn làm chủ xã hội",
      "B. Hệ tư tưởng chính trị của giai cấp công nhân là hệ tư tưởng duy nhất tồn tại trong xã hội. Giai cấp công nhân là chủ thể toàn bộ giá trị văn hóa tinh thần của xã hội",
      "C. Tồn tại đan xen, đấu tranh lẫn nhau giữa những nhân tố của xã hội mới và những tàn dư của xã hội cũ trên mọi lĩnh vực của đời sống xã hội",
      "D. Tồn tại kinh tế thị trường định hướng xã hội chủ nghĩa, ở đó, các chủ thể kinh tế đều chịu sự chi phối của quy luật thị trường"
    ],
    "correct": 3
  },
  {
    "text": "Đặc điểm của thời kỳ quá độ lên chủ nghĩa xã hội trên lĩnh vực kinh tế là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Còn tồn tại nhiều hệ tư tưởng khác nhau",
      "B. Còn tồn tại nhiều thành phần kinh tế khác nhau",
      "C. Còn tồn tại giai cấp đối kháng và đấu tranh giai cấp",
      "D. Còn tồn tại nhiều tàn dư của chế độ cũ để lại"
    ],
    "correct": 2
  },
  {
    "text": "Thực chất của thời kỳ quá độ lên chủ nghĩa xã hội là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là tiếp tục cuộc đấu tranh giai cấp giữa giai cấp công nhân, nhân dân lao động chống lại giai cấp tư sản và các thế lực đi ngược lại lợi ích của giai cấp công nhân và nhân dân lao động",
      "B. Là phát triển kinh tế hàng hóa nhiều thành phần theo định hướng xã hội chủ nghĩa",
      "C. Là duy trì nhiều hình thức phân phối khác nhau, trong đó phân phối theo lao động là cơ bản",
      "D. Là duy trì nhiều hình thức sở hữu khác nhau, trong đó sở hữu toàn dân là hình thức sở hữu chủ yếu"
    ],
    "correct": 1
  },
  {
    "text": "Chỉ ra luận điểm không chính xác?",
    "type": "Multiple Choice",
    "options": [
      "A. Chủ nghĩa xã hội là một xã hội tốt đẹp, xóa bỏ mọi hình thức sở hữu",
      "B. Chủ nghĩa xã hội là giai đoạn đầu của hình thái kinh tế xã hội cộng sản chủ nghĩa",
      "C. Thời kỳ quá độ là thời kỳ tồn tại đan xen những yếu tố của xã hội cũ và những nhân tố của xã hội mới",
      "D. Xã hội hóa lực lượng sản xuất là cơ sở vật chất chủ yếu cho sự ra đời của chủ nghĩa xã hội"
    ],
    "correct": 1
  },
  {
    "text": "Điền vào chỗ trống để hoàn thiện luận điểm của C.Mác và Ph.Ăngghen: “Đặc trưng của (…) không phải là xóa bỏ chế độ sở hữu nói chung mà là xóa bỏ chế độ sở hữu tư sản”.",
    "type": "Fill-in-the-Blank",
    "correct": "Chủ nghĩa xã hội"
  },
  {
    "text": "Tại sao Việt Nam không lựa chọn con đường phát triển của đất nước là đi lên chủ nghĩa tư bản?",
    "type": "Multiple Choice",
    "options": [
      "A. Vì Việt Nam là nước nông nghiệp lạc hậu",
      "B. Vì giai cấp tư sản ở Việt Nam chưa phát triển",
      "C. Vì công nghiệp hóa, hiện đại hóa ở Việt Nam mới chỉ bắt đầu",
      "D. Vì về bản chất chủ nghĩa tư bản là bóc lột lao động"
    ],
    "correct": 4
  },
  {
    "text": "Thực chất của con đường quá độ lên chủ nghĩa xã hội ở Việt Nam là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là bỏ qua cả những thành tựu và hạn chế của chủ nghĩa tư bản",
      "B. Là bỏ qua việc xác lập vị trí thống trị của quan hệ sản xuất và kiến trúc thượng tầng tư bản chủ nghĩa",
      "C. Là bỏ qua việc phát triển sản xuất hàng hóa, xác lập nền kinh tế kế hoạch hóa, tập trung",
      "D. Là bỏ qua việc phát triển của nền đại công nghiệp tiến thẳng lên kinh tế tri thức"
    ],
    "correct": 2
  },
  {
    "text": "Luận điểm nào sau đây sai?",
    "type": "Multiple Choice",
    "options": [
      "A. Nhà nước xã hội chủ nghĩa xây dựng trên cơ sở chế độ sở hữu xã hội về tư liệu sản xuất chủ yếu",
      "B. Nhà nước xã hội chủ nghĩa xây dựng trên nền tảng tinh thần là lý luận của Chủ nghĩa Mác - Lênin",
      "C. Nhà nước xã hội chủ nghĩa mang bản chất của giai cấp công nhân",
      "D. Nhà nước xã hội chủ nghĩa xây dựng trên nền tảng chế độ tư hữu về tư liệu sản xuất chủ yếu"
    ],
    "correct": 4
  },
  {
    "text": "Tìm đáp án sai về nhà nước pháp quyền xã hội chủ nghĩa Việt Nam?",
    "type": "Multiple Choice",
    "options": [
      "A. Là nhà nước của dân, do dân, vì dân",
      "B. Nhà nước phải do Đảng Cộng sản Việt Nam lãnh đạo",
      "C. Là nhà nước tôn trọng quyền con người, coi người là chủ thể, là trung tâm của sự phát triển",
      "D. Là nhà nước dựa trên nguyên tắc quyền lực thuộc về thiểu số"
    ],
    "correct": 4
  },
  {
    "text": "Sự thống trị của giai cấp vô sản có sự khác biệt về chất so với sự thống trị của các giai cấp bóc lột trước đây là ở chỗ:",
    "type": "Multiple Choice",
    "options": [
      "A. Sự thống trị và lợi ích chỉ phục vụ cho thiểu số",
      "B. Sự thống trị của thiểu số đối với tất cả các giai cấp tầng lớp nhân dân lao động",
      "C. Sự thống trị của đa số đối và vì lợi ích chung của toàn xã hội",
      "D. Tất cả các đáp án"
    ],
    "correct": 3
  },
  {
    "text": "Điền vào chỗ trống: “nhà nước xã hội chủ nghĩa là nhà nước mà ở đó, sự thống trị chính trị thuộc về…”",
    "type": "Fill-in-the-Blank",
    "correct": "Giai cấp công nhân"
  },
  {
    "text": "Chế độ dân chủ đầu tiên ra đời gắn với xã hội nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Xã hội cộng sản nguyên thủy.",
      "B. Xã hội chiếm hữu nô lệ.",
      "C. Xã hội phong kiến.",
      "D. Xã hội tư bản chủ nghĩa."
    ],
    "correct": 2
  },
  {
    "text": "Dân chủ xã hội chủ nghĩa ra đời gắn với sự kiện nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân giành được chính quyền.",
      "B. Giai cấp công nhân bắt đầu đấu tranh chống áp bức, bóc lột.",
      "C. Giai cấp công nhân xây dựng xong CNXH",
      "D. Giai cấp công nhân có đảng cộng sản."
    ],
    "correct": 1
  },
  {
    "text": "Dân chủ xã hội chủ nghĩa mang bản chất của giai cấp nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp nông dân.",
      "B. Giai cấp công nhân.",
      "C. Tầng lớp trí thức.",
      "D. Tầng lớp doanh nhân"
    ],
    "correct": 2
  },
  {
    "text": "Dân chủ đại diện được thực hiện như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Nhân dân trực tiếp thực hiện quyền làm chủ nhà nước và xã hội.",
      "B. Thực hiện thông qua trưng cầu dân ý.",
      "C. Nhân dân giao quyền lực của mình cho hệ thống cơ quan dân cử.",
      "D. Nhân dân tham gia vào các công việc của nhà nước và cộng đồng dân cư."
    ],
    "correct": 3
  },
  {
    "text": "Cơ cấu xã hội - giai cấp là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là hệ thống gồm giai cấp cơ bản và không cơ bản tồn tại khách quan trong một chế độ xã hội nhất định",
      "B. Là hệ thống các giai cấp thống trị và bị trị tồn tại khách quan trong một chế độ xã hội nhất định",
      "C. Là hệ thống các giai cấp, tầng lớp xã hội tồn tại khách quan trong một chế độ xã hội nhất định.",
      "D. Là hệ thống các giai cấp bị bóc lột và bóc lột tồn tại khách quan trong một chế độ xã hội nhất định"
    ],
    "correct": 1
  },
  {
    "text": "Cơ cấu xã hội - giai cấp trong thời kỳ quá độ lên CNXH được hình thành khi:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân giành được chính quyền",
      "B. Giai cấp công nhân đòi tăng lương giảm giờ làm",
      "C. Giai cấp công nhân tiến hành cách mạng",
      "D. Giai cấp công nhân xây dựng nền văn hóa tiên tiến, đậm đà bản sắc dân tộc"
    ],
    "correct": 1
  },
  {
    "text": "Trong xã hội có giai cấp, cơ cấu nào có vị trí quan trọng hàng đầu chi phối các loại hình cơ cấu xã hội khác?",
    "type": "Multiple Choice",
    "options": [
      "A. Cơ cấu xã hội - nghề nghiệp",
      "B. Cơ cấu xã hội dân số",
      "C. Cơ cấu xã hội dân tộc",
      "D. Cơ cấu xã hội giai cấp"
    ],
    "correct": 4
  },
  {
    "text": "Sự biến đổi của cơ cấu xã hội - giai cấp được quyết định bởi sự biến động của cơ cấu nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Cơ cấu xã hội - dân số",
      "B. Cơ cấu xã hội - kinh tế",
      "C. Cơ cấu xã hội - dân tộc",
      "D. Cơ cấu xã hội-tôn giáo"
    ],
    "correct": 2
  },
  {
    "text": "Các giai cấp, tầng lớp xã hội cơ bản trong cơ cấu xã hội giai cấpcủa thời kỳ quá độ lên Chủ nghĩa xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp chủ nô và giai cấp nô lệ",
      "B. Giai cấp địa chủ và giai cấp nông dân",
      "C. Giai cấp địa chủ và giai cấp tư sản",
      "D. Giai cấp công nhân, giai cấp nông dân, tầng lớp trí thức, tầng lớp doanh nhân."
    ],
    "correct": 4
  },
  {
    "text": "Yếu tố quyết định mối quan hệ giữa các giai cấp, tầng lớp, các nhóm xã hội trong cơ cấu xã hội - giai cấp",
    "type": "Multiple Choice",
    "options": [
      "A. Cùng đấu tranh giành chính quyền",
      "B. Cùng lật đổ chính quyền của giai cấp tư sản",
      "C. Cùng lật đổ chính quyền của giai cấp chủ nô",
      "D. Cùng chung sức cải tạo xã hội cũ, xây dựng xã hội mới"
    ],
    "correct": 4
  },
  {
    "text": "Cơ cấu xã hội - giai cấp là căn cứ cơ bản để xây dựng chính sách phát triển các lĩnh vực cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Kinh tế",
      "B. Chính trị, tư tưởng",
      "C. Văn hoá",
      "D. Tất cả các đáp án"
    ],
    "correct": 4
  },
  {
    "text": "Tìm đáp án đúng, khi xem xét cơ cấu xã hội - giai cấp cần:",
    "type": "Multiple Choice",
    "options": [
      "A. Tuyệt đối hóa cơ cấu xã hội giai cấp",
      "B. Xem nhẹ các loại hình cơ cấu xã hội khác",
      "C. Xóa bỏ nhanh chóng các giai cấp, tầng lớp xã hội khác",
      "D. Không tuyệt đối hóa cơ cấu xã hội giai cấp"
    ],
    "correct": 4
  },
  {
    "text": "Tìm đáp án SAI: Khi xem xét cơ cấu xã hội - giai cấp cần:",
    "type": "Multiple Choice",
    "options": [
      "A. Thấy được vai trò quan trọng của cơ cấu xã hội",
      "B. Không tuyệt đối hóa vai trò của cơ cấu xã hội - giai cấp",
      "C. Xóa bỏ nhanh chóng các giai cấp, tầng lớp xã hội khác",
      "D. Coi trọng vai trò của các giai cấp tầng lớp xã hội khác"
    ],
    "correct": 3
  },
  {
    "text": "Vị trí của cơ cấu xã hội - giai cấp trong cơ cấu xã hội:",
    "type": "Multiple Choice",
    "options": [
      "A. Các loại hình cơ cấu xã hội khác chi phối cơ cấu xã hội - giai cấp",
      "B. Cơ cấu xã hội - giai cấp phụ thuộc hoàn toàn vào các cơ cấu xã hội khác",
      "C. Cơ cấu xã hội - giai cấp chi phối các loại hình cơ cấu xã hội khác",
      "D. Cơ cấu xã hội - giai cấp độc lập với các loại hình cơ cấu xã hội khác"
    ],
    "correct": 3
  },
  {
    "text": "Điền từ còn thiếu vào chỗ trống: Theo Chủ nghĩa Mác - Lênin, hình thái kinh tế xã hội cộng sản chủ nghĩa đã được…..từ trong lòng xã hội tư bản",
    "type": "Fill-in-the-Blank",
    "correct": "Thai nghén"
  },
  {
    "text": "Liên minh công nhân với nông dân và các tầng lớp xã hội khác là hình thức liên minh:",
    "type": "Multiple Choice",
    "options": [
      "A. Giản đơn",
      "B. Đặc thù",
      "C. Có giới hạn",
      "D. Đặc biệt"
    ],
    "correct": 4
  },
  {
    "text": "Điền vào chỗ trống: ‘…là một hình thức đặc biệt của liên minh giai cấp giữa giai cấp vô sản với đông đảo những tầng lớp lao động không phải vô sản”",
    "type": "Fill-in-the-Blank",
    "correct": "Chuyên chính vô sản"
  },
  {
    "text": "Liên minh giữa giai cấp công nhân với giai cấp nông dân và các tầng lớp xã hội khác nhằm chống lại:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp chủ nô",
      "B. Giai cấp phong kiến",
      "C. Giai cấp tiểu tư sản",
      "D. Giai cấp tư sản"
    ],
    "correct": 4
  },
  {
    "text": "Điền vào chỗ trống: Cơ cấu xã hội - giai cấp biến đổi… làm xuất hiện các tầng lớp xã hội mới.",
    "type": "Fill-in-the-Blank",
    "correct": "Phức tạp, đa dạng"
  },
  {
    "text": "Điền vào chỗ trống: Cơ cấu xã hội giai cấp biến đổi trong mối quan hệ…, từng bước xóa bỏ bất bình đẳng xã hội dẫn đến sự xích lại gần nhau.",
    "type": "Fill-in-the-Blank",
    "correct": "Vừa đấu tranh, vừa liên minh"
  },
  {
    "text": "Theo V.I. Lênin, hình thức liên minh đặc biệt trong thời kỳ quá độ lên CNXH là:",
    "type": "Multiple Choice",
    "options": [
      "A. Liên minh giữa giai cấp vô sản với giai cấp tư sản và các tầng lớp xã hội khác",
      "B. Liên minh giữa giai cấp công nhân với giai cấp tiểu tư sản",
      "C. Liên minh giữa giai cấp công nhân với giai cấp nông dân và các tầng lớp xã hội khác",
      "D. Liên minh giữa giai cấp công nhân với tầng lớp trí thức"
    ],
    "correct": 3
  },
  {
    "text": "Điền từ vào chỗ trống: “Nếu không liên minh với… thì không thể có được chính quyền của giai cấp vô sản”",
    "type": "Fill-in-the-Blank",
    "correct": "Nông dân"
  },
  {
    "text": "Chọn đáp án đúng vào chỗ trống: “Nguyên tắc cao nhất của chính quyền là duy trì khối liên minh giữa… để giai cấp vô sản có thể giữ được vai trò lãnh đạo và chính quyền nhà nước.”",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp tư sản và giai cấp công nhân",
      "B. Giai cấp vô sản và nông dân",
      "C. Giai cấp tiểu tư sản và giai cấp công nhân",
      "D. Giai cấp nông dân và giai cấp tư sản"
    ],
    "correct": 2
  },
  {
    "text": "Trong thời kỳ quá độ lên CNXH ở Việt Nam hiện nay, kết cấu kinh tế ở nước ta gồm:",
    "type": "Multiple Choice",
    "options": [
      "A. Kinh tế nhà nước, kinh tế tập thể, kinh tế tư nhân, kinh tế có vốn đầu tư nước ngoài",
      "B. Chỉ có kinh tế nhà nước và kinh tế tập thể",
      "C. Kinh tế tư nhân và kinh tế tập thể",
      "D. Kinh tế tư nhân và kinh tê nhà nước"
    ],
    "correct": 1
  },
  {
    "text": "Trong thời kỳ quá độ lên CHXH, giai cấp công nhân, giai cấp nông dân và tầng lớp lao động khác đóng vai trò:",
    "type": "Multiple Choice",
    "options": [
      "A. Lực lượng sản xuất tiên tiến nhất.",
      "B. Lực lượng sản xuất trực tiếp",
      "C. Đại diện cho quan hệ sản xuất cơ bản",
      "D. Là lực lượng sản xuất cơ bản, lực lượng chính trị - xã hội to lớn"
    ],
    "correct": 4
  },
  {
    "text": "Liên minh giai cấp, tầng lớp trong thời kỳ quá độ lên CNXH là:",
    "type": "Multiple Choice",
    "options": [
      "A. Sự đấu tranh giữa các giai cấp, tầng lớp xã hội",
      "B. Sự liên kết, hợp tác, hỗ trợ nhau giữa các giai cấp, tầng lớp xã hội",
      "C. Sự hợp nhất giữa các giai cấp, tầng lớp xã hội",
      "D. Sự đồng nhất giữa các giai cấp, tầng lớp xã hội"
    ],
    "correct": 2
  },
  {
    "text": "Thời kỳ trước đổi mới, cơ cấu xã hội - giai cấp ở Việt Nam gồm những những giai cấp cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân, giai cấp nông dân, giai cấp tư sản",
      "B. Giai cấp công nhân, tầng lớp tiểu chủ và tầng lớp tri thức",
      "C. Giai cấp công nhân, giai cấp nông dân, tầng lớp trí thức",
      "D. Giai cấp công nhân, giai cấp nông dân, giai cấp tiểu tư sản."
    ],
    "correct": 3
  },
  {
    "text": "Chọn phương án đúng để điền vào chỗ trống: Tăng cường khối đại đoàn kết toàn dân tộc trên nền tảng liên minh .... với ... và ... do Đảng cộng sản lãnh đạo.",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân - giai cấp nông dân - đội ngũ trí thức",
      "B. Giai cấp công nhân - giai cấp nông dân - giai cấp tư sản",
      "C. Giai cấp công nhân - giai cấp nông dân - tầng lớp tiểu tư sản",
      "D. Giai cấp công nhân - giai cấp nông dân - đội ngũ doanh nhân"
    ],
    "correct": 1
  },
  {
    "text": "Trong hệ thống chính sách xã hội, chính sách nào được đặt lên vị trí hàng đầu?",
    "type": "Multiple Choice",
    "options": [
      "A. Chính sách liên quan đến cơ cấu xã hội - giai cấp",
      "B. Chính sách liên quan đến cơ cấu xã hội - nghề nghiệp",
      "C. Chính sách liên quan đến cơ cấu xã hội - dân tộc",
      "D. Chính sách liên quan đến cơ cấu xã hội - tôn giáo"
    ],
    "correct": 1
  },
  {
    "text": "Khối liên minh công nông trí thức đặt dưới sự lãnh đạo của:",
    "type": "Multiple Choice",
    "options": [
      "A. Nhà nước xã hội chủ nghĩa",
      "B. Đảng cộng sản.",
      "C. Các tổ chức chính trị - xã hội",
      "D. Chính phủ"
    ],
    "correct": 2
  },
  {
    "text": "Trong thời kỳ quá độ lên CNXH, giai cấp nông dân có xu hướng:",
    "type": "Multiple Choice",
    "options": [
      "A. Giảm dần về số lượng và tỷ lệ",
      "B. Tăng lên về số lượng và tỷ lệ",
      "C. Giảm về số lượng và tăng tỷ lệ",
      "D. Nhảy vọt về số lượng và tỷ lệ"
    ],
    "correct": 1
  },
  {
    "text": "Trongcơ cấu xã hội - giai cấp Việt Nam, đội ngũ thanh niên có vai trò:",
    "type": "Multiple Choice",
    "options": [
      "A. Là một lực lượng quan trọng và đông đảo",
      "B. Là lực lượng lao động đặc biệt",
      "C. Là giai cấp lãnh đạo",
      "D. Là rường cột của nước nhà"
    ],
    "correct": 1
  },
  {
    "text": "Trong cơ cấu xã hội - giai cấp Việt Nam, giai cấp có vai trò là lực lượng lao động sáng tạo đặc biệt là:",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân",
      "B. Giai cấp nông dân",
      "C. Đội ngũ trí thức",
      "D. Đội ngũ thanh niên"
    ],
    "correct": 3
  },
  {
    "text": "Trong cơ cấu xã hội - giai cấp Việt Nam, đội ngũ trí thức có vai trò gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là một lực lượng quan trọng và đông đảo",
      "B. Là rường cột của nước nhà",
      "C. Là lực lượng lao động sáng tạo đặc biệt",
      "D. Là giai cấp lãnh đạo"
    ],
    "correct": 3
  },
  {
    "text": "Cơ cấu xã hội giai cấp của Việt Nam ở thời kỳ quá độ lên CNXH gồm những giai cấp, tầng lớp cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân, giai cấp nông dân, giai cấp tư sản",
      "B. Giai cấp công nhân, giai cấp nông dân, gia cấp chủ nô, tầng lớp tiểu chủ",
      "C. Giai cấp công nhân, giai cấp nông dân, đội ngũ trí thức, giai cấp địa chủ",
      "D. Giai cấp công nhân, giai cấp nông dân, đội ngũ trí thức, đội ngũ doanh nhân, phụ nữ, thanh niên"
    ],
    "correct": 4
  },
  {
    "text": "Thời kỳ trước đổi mới, cơ cấu xã hội - giai cấp ở Việt Nam gồm những những giai cấp cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân, giai cấp nông dân, giai cấp tư sản",
      "B. Giai cấp công nhân, tầng lớp tiểu chủ và tầng lớp tri thức",
      "C. Giai cấp công nhân, giai cấp nông dân, tầng lớp trí thức",
      "D. Giai cấp công nhân, giai cấp nông dân, giai cấp tiểu tư sản."
    ],
    "correct": 3
  },
  {
    "text": "Điền vào chỗ trống: Sự biến đổi của (…) tất yếu ảnh hưởng đến sự biến đổi của các cơ cấu xã hội khác và tác động đến sự biến đổi của toàn bộ cơ cấu xã hội.",
    "type": "Multiple Choice",
    "options": [
      "A. Cơ cấu xã hội – giai cấp",
      "B. Cơ cấu xã hội - dân số",
      "C. Cơ cấu xã hội - nghề nghiệp",
      "D. Cơ cấu xã hội – dân cư"
    ],
    "correct": 1
  },
  {
    "text": "Điền vào chỗ trống: Ở Việt Nam hiện nay, giai cấp công nhân có vai trò quan trọng đặc biệt, là giai cấp (…) cách mạng thông qua đội tiền phong là ĐCS Việt Nam.",
    "type": "Multiple Choice",
    "options": [
      "A. Quản lý",
      "B. Lãnh đạo",
      "C. Tiên tiến",
      "D. Cầm đầu"
    ],
    "correct": 2
  },
  {
    "text": "Chọn phương án đúng nhất quan điểm của Đảng: “Tăng cường khối đại đoàn kết toàn dân tộc trên nền tảng liên minh (…) do Đảng lãnh đạo.",
    "type": "Multiple Choice",
    "options": [
      "A. Công - nông",
      "B. Các dân tộc",
      "C. Công – nông – trí thức",
      "D. Công – nông – trí và doanh nhân"
    ],
    "correct": 3
  },
  {
    "text": "Tôn giáo là một hiện tượng xã hội – văn hóa do con người sáng tạo ra?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Hai xu hướng khách quan của sự phát triển của dân tộc bao gồm: xu hướng tách ra để hình thành cộng đồng dân tộc độc lập và xu hướng cùng phát triển song song của các dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Đúng",
      "B. Sai"
    ],
    "correct": 1
  },
  {
    "text": "Trong những nội dung của quyền dân tộc tự quyết, nội dung nào được coi là cơ bản, trước hết:",
    "type": "Multiple Choice",
    "options": [
      "A. Quyền tự quyết về các mối quan hệ quốc tế",
      "B. Quyền tự quyết về văn hóa.",
      "C. Quyền tự quyết về chính trị.",
      "D. Quyền tự quyết về kinh tế. Trong một quốc gia có nhiều dân tộc như Việt Nam, để các dân"
    ],
    "correct": 3
  },
  {
    "text": "Trong một quốc gia có nhiều dân tộc như Việt Nam, để các dân tộc thực sự bình đẳng, thì việc giải quyết vấn đề nào được coi là ý nghĩa cơ bản",
    "type": "Multiple Choice",
    "options": [
      "A. Nâng cao trình độ văn hóa cho các dân tộc thiểu số.",
      "B. Kiên quyết chống kỳ thị dân tộc.",
      "C. Ưu tiêu giúp đỡ về tư liệu sinh hoạt cho đồng bào dân tộc thiểu số.",
      "D. Xóa bỏ dần khoảng cách chênh lệch về mọi mặt giữa các dân tộc do lịch sử để lại. Ở Việt Nam, sự tác động của nhân tố cơ bản nào hình thành nên dân tộc?"
    ],
    "correct": 4
  },
  {
    "text": "Ở Việt Nam, sự tác động của nhân tố cơ bản nào hình thành nên dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Do yêu cầu đoàn kết của quá trình đấu tranh chống thiên tai và xâm lược",
      "B. Do quá trình đồng hóa của các bộ tộc phong kiến.",
      "C. Do sự phát triển kinh tế.",
      "D. Cả 3 phương án trên."
    ],
    "correct": 1
  },
  {
    "text": "Đâu không phải là nội dung trong “Cương lĩnh dân tộc của chủ nghĩa Mác- Lênin”",
    "type": "Multiple Choice",
    "options": [
      "A. Các dân tộc được tự do phát triển kinh tế",
      "B. Các dân tộc hoàn toàn bình đẳng.",
      "C. Các dân tộc hoàn toàn tự quyết.",
      "D. Liên hiệp công nhân tất cả các dân tộc"
    ],
    "correct": 3
  },
  {
    "text": "Trong những nội dung sau đây, nội dung nào không phải là đặc điểm của dân tộc Việt Nam.",
    "type": "Multiple Choice",
    "options": [
      "A. Các dân tộc – tộc người có vùng lãnh thổ riêng.",
      "B. Có sự chênh lệch về số dân giữa các dân tộc.",
      "C. Các dân tộc cư trú xen kẽ nhau",
      "D. Các dân tộc Việt Nam có truyền thống đoàn kết gắn bó lâu dài trong cộng đồng dân tộc – quốc gia thống nhất."
    ],
    "correct": 1
  },
  {
    "text": "Những nội dung cơ bản của cương lĩnh dân tộc của chủ nghĩa Mác – lênin?",
    "type": "Multiple Choice",
    "options": [
      "A. Các dân tộc hoàn toàn bình đẳng",
      "B. Các dân tộc được quyền tự quyết",
      "C. Liên hiệp công nhân tất cả các dân tộc",
      "D. Cả 3 phương án trên"
    ],
    "correct": 4
  },
  {
    "text": "Nền tảng để tăng cường đoàn kết và thực hiện quyền bình đẳng dân tộc trong chính sách dân tộc của Đảng và Nhà nước Việt Nam?",
    "type": "Multiple Choice",
    "options": [
      "A. Phát triển kinh tế - xã hội của các dân tộc.",
      "B. Phát triển văn hóa - xã hội các dân tộc.",
      "C. Tăng cường sức mạnh bảo vệ tổ quốc",
      "D. Thực hiện tốt những chính sách xã hội, đảm bảo an ninhxã hội"
    ],
    "correct": 1
  },
  {
    "text": "Những nguồn gốc cơ bản ra đời của tôn giáo?",
    "type": "Multiple Choice",
    "options": [
      "A. Nguồn gốc tự nhiên, kinh tế - xã hội.",
      "B. Nguồn gốc nhận thức.",
      "C. Nguồn gốc tâm lý",
      "D. Cả 3 phương án trên"
    ],
    "correct": 4
  },
  {
    "text": "Tín ngưỡng tôn giáo khác với tín ngưỡng khác ở điểm nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Tín ngưỡng tôn giáo có số lượng tín đồ đông",
      "B. Tín ngưỡng tôn giáo ra đời từ rất sớm",
      "C. Tín ngưỡng tôn giáo tồn tại ở tất cả các quốc gia trên thế giới.",
      "D. Tín ngưỡng tôn giáo có hệ thống giáo lý, giáo luật."
    ],
    "correct": 4
  },
  {
    "text": "Vì sao tính chất của tôn giáo mang tính chính trị?",
    "type": "Multiple Choice",
    "options": [
      "A. Vì các giai cấp bóc lột, thống trị sử dụng tôn giáo để phục vụ cho lợi ích giai cấp mình.",
      "B. Vì số lượng tín đồ tôn giáo đông.",
      "C. Xuất phát từ hiểu biết hạn chế của con người.",
      "D. Cả 3 phương án trên."
    ],
    "correct": 1
  },
  {
    "text": "Vì sao cần tôn trọng, bảo đảm quyền tự do tín ngưỡng tôn giáo và không tín ngưỡng tôn giáo của nhân dân?",
    "type": "Multiple Choice",
    "options": [
      "A. Tín ngưỡng tôn giáo là niềm tin sâu sắc của quần chúng vào đấng tối cao, đấng thiêng liêng nào đó mà họ tôn thờ",
      "B. Vì tín ngưỡng tôn giáo có số lượng tín đồ đông.",
      "C. Vì tín ngưỡng tôn giáo mang tính chính trị.",
      "D. Cả 3 phương án trên"
    ],
    "correct": 1
  },
  {
    "text": "Đâu là đặc trưng quan trọng nhất của dân tộc quốc gia và là cơ sở liên kết các bộ phận, các thành viên của dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Có lãnh thổ chung ổn định không bị chia cắt",
      "B. Có chung phương thức sinh hoạt kinh tế",
      "C. Có sự quản lý của một nhà nước",
      "D. Có nét tâm lý biểu hiện qua nền văn hóa dân tộc"
    ],
    "correct": 2
  },
  {
    "text": "Đâu là tiêu chí quan trọng nhất để phân định một tộc người và có vị trí quyết định đối với sự tồn tại và phát triển của mỗi dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Cộng đồng về ngôn ngữ",
      "B. Cộng đồng về văn hóa",
      "C. Ý thức tự giác tộc người",
      "D. Cộng đồng về phương thức sinh hoạt kinh tế"
    ],
    "correct": 3
  },
  {
    "text": "Điền từ vào chỗ trống: “Trong xu hướng thứ nhất, do sự thức tỉnh và sự trưởng thành của ý thức dân tộc mà các cộng đồng dân cư muốn …… để xác lập dân tộc độc lập”",
    "type": "Fill-in-the-Blank",
    "correct": "Tách ra"
  },
  {
    "text": "Tìm đáp án đúng nhất, điền từ vào chỗ trống: “Trong xu hướng thứ hai, các dân tộc trong một quốc gia đa dân tộc, thậm chí ở nhiều quốc gia muốn … với nhau”?",
    "type": "Multiple Choice",
    "options": [
      "A. Tách ra",
      "B. Tất cả các đáp án",
      "C. Hợp nhất làm một",
      "D. Liên hiệp lại"
    ],
    "correct": 4
  },
  {
    "text": "Nội dung đầy đủ theo cương lĩnh dân tộc của Chủ nghĩa Mác – Lênin là:",
    "type": "Multiple Choice",
    "options": [
      "A. Các dân tộc hoàn toàn bình đẳng, các dân tộc được quyền tự quyết, liên hiệp công nhân tất cả các dân tộc",
      "B. Các dân tộc cần có sự phân biệt và liên hiệp công nhân tất cả các dân tộc",
      "C. Các dân tộc có quyền bình đẳng, có quyền tự quyết, liên hiệp giai cấp tư sản của tất cả các dân tộc",
      "D. Các dân tộc không có quyền tự quyết và liên hiệp công nhân các dân tộc"
    ],
    "correct": 1
  },
  {
    "text": "Điền từ đúng nhất vào chỗ trống: Quyền bình đẳng giữa các dân tộc là quyền… của các dân tộc",
    "type": "Fill-in-the-Blank",
    "correct": "Thiêng liêng"
  },
  {
    "text": "Trong Cương lĩnh dân tộc của V.I.Lênin, các dân tộc được quyền bình đẳng được hiểu là:",
    "type": "Multiple Choice",
    "options": [
      "A. Không phân biệt dân tộc lớn hay nhỏ, trình độ phát triển cao hay thấp",
      "B. Các dân tộc đều có quyền lợi và nghĩa vụ như nhau",
      "C. Không dân tộc nào được giữa đặc quyền, đặc lợi về kinh tế, chính trị, văn hóa",
      "D. Tất cả các đáp án"
    ],
    "correct": 4
  },
  {
    "text": "Điền từ đúng nhất vào chỗ trống: “Quyền dân tộc tự quyết là quyền của các dân tộc… lấy vận mệnh của dân tộc mình”",
    "type": "Fill-in-the-Blank",
    "correct": "Tự quyết định"
  },
  {
    "text": "Tìm câu trả lời sai về quyền tự quyết của các dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Là quyền tự quyết định vận mệnh của dân tộc mình",
      "B. Là quyền của các tộc người thiểu số trong một quốc gia đa tộc người muốn phân lập thành quốc gia dân tộc",
      "C. Là quyền tự tách ra thành một quốc gia dân tộc độc lập đồng thời có quyền tự nguyện liên hiệp với dân tộc khác trên cơ sở bình đẳng",
      "D. Việc thực hiện quyền dân tộc tự quyết phải xuất phát từ thực tiễn - cụ thể và phải đứng trên lập trường của giai cấp công nhân"
    ],
    "correct": 2
  },
  {
    "text": "Theo chủ nghĩa Mác - Lênin, khi giải quyết vấn đề dân tộc phải đứng vững trên lập trường của giai cấp, tầng lớp nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Giai cấp công nhân",
      "B. Giai cấp nông dân",
      "C. Giai cấp tư sản",
      "D. Tầng lớp trí thức"
    ],
    "correct": 1
  },
  {
    "text": "Ở Việt Nam: Thờ cúng Tổ tiên, Thờ anh hùng dân tộc, Thờ Mẫu, Thờ Thành hoàng làng thuộc về loại hình nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Tín ngưỡng",
      "B. Tôn giáo",
      "C. Mê tín",
      "D. Mê tín dị đoan"
    ],
    "correct": 1
  },
  {
    "text": "Ở phương Tây sự hình thành dân tộc gắn liền với sự ra đời của chế độ...",
    "type": "Multiple Choice",
    "options": [
      "A. Nguyên thủy",
      "B. Chiếm hữu nô lệ",
      "C. Phong kiến",
      "D. Tư bản chủ nghĩa"
    ],
    "correct": 2
  },
  {
    "text": "Trong chủ nghĩa xã hội, quan hệ dân tộc có xu hướng như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Ngày càng bình đẳng.",
      "B. Ngày càng bất bình đẳng.",
      "C. Xung đột giữa các dân tộc sâu sắc hơn.",
      "D. Khác biệt giữa các dân tộc sẽ bị triệt tiêu."
    ],
    "correct": 1
  },
  {
    "text": "Chỉ ra luận điểm KHÔNG chính xác?",
    "type": "Multiple Choice",
    "options": [
      "A. Quyền bình đẳng dân tộc là cơ sở cho quyền tự quyết dân tộc.",
      "B. Quyền bình đẳng và quyền tự quyết dân tộc không tự nhiên mà có được.",
      "C. Quyền tự quyết dân tộc là ảo tưởng đối với các dân tộc kém phát triển.",
      "D. Quyền bình đẳng và quyền tự quyết dân tộc đi liền với nhau."
    ],
    "correct": 3
  },
  {
    "text": "Theo quan điểm của CNXHKH, yếu tố nào quyết định đến thực hiện quyền bình đẳng dân tộc?",
    "type": "Multiple Choice",
    "options": [
      "A. Xóa bỏ tình trạng chênh lệch trong sự phát triển kinh tế, văn hóa của các dân tộc.",
      "B. Xóa bỏ tình trạng giai cấp này áp bức giai cấp khác, trên cơ sở xóa bỏ chế độ tư hữu.",
      "C. Các nhà nước dân tộc có chủ trương, chính sách đúng đắn trong giải quyết quan hệ dân tộc.",
      "D. Các đảng chính trị có đường lối đúng đắn định hướng quan hệ dân tộc."
    ],
    "correct": 2
  },
  {
    "text": "Đặc trưng nào KHÔNG thuộc về đặc trưng của dân tộc - tộc người?",
    "type": "Multiple Choice",
    "options": [
      "A. Có lãnh thổ chung",
      "B. Cộng đồng về ngôn ngữ.",
      "C. Các đặc điểm chung thuộc bản sắc văn hóa.",
      "D. Ý thức tự giác tộc người."
    ],
    "correct": 1
  },
  {
    "text": "Cơ sở hình thành gia đình dựa trên mối quan hệ cơ bản nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Quan hệ hôn nhân và quan hệ kinh tế",
      "B. Quan hệ hôn nhân và quan hệ văn hóa",
      "C. Quan hệ huyết thống và quan hệ kinh tế",
      "D. Quan hệ hôn nhân và quan hệ huyết thống"
    ],
    "correct": 4
  },
  {
    "text": "Đặc điểm của quan hệ huyết thống là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Là quan hệ giữa những người cùng dòng máu",
      "B. Là quan hệ giữa những người cùng sở hữu tư liệu sản xuất",
      "C. Là quan hệ giữa những người cùng tôn giáo",
      "D. Là quan hệ giữa những người cùng văn hóa"
    ],
    "correct": 1
  },
  {
    "text": "Theo Ph.Ăngghen, hai nhân tố quan trọng nhất quyết định đến sự phát triển của con người và xã hội đó là:",
    "type": "Multiple Choice",
    "options": [
      "A. Trình độ phát triển của lao động và trình độ phát triển của gia đình",
      "B. Sự phát triển về dân số và sự phong phú về tài nguyên thiên nhiên",
      "C. Trình độ phát triển của lao động và số lượng dân số",
      "D. Số lượng dân số và trình độ phát triển của gia đình"
    ],
    "correct": 1
  },
  {
    "text": "Nội dung cơ bản của xây dựng gia đình trong chủ nghĩa xã hội như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Bảo vệ chế độ hôn nhân một vợ một chồng, thực hiện bình đẳng trong gia đình",
      "B. Chỉ tập trung xây dựng mô hình gia đình hạt nhân, bảo vệ chế độ hôn nhân một vợ một chồng",
      "C. Chỉ tập trung xây dựng mô hình gia đình mở rộng, thực hiện đoàn kết hòa thuận giữa các thành viên trong gia đình",
      "D. Xây dựng gia đình một vợ một chồng theo nguyên tắc gia trưởng"
    ],
    "correct": 1
  },
  {
    "text": "Điền vào chỗ trống, theo chủ tịch Hồ Chí Minh: “Hạt nhân của xã hội chính là…..”",
    "type": "Fill-in-the-Blank",
    "correct": "Gia đình"
  },
  {
    "text": "Nội dung cơ bản của xây dựng gia đình trong chủ nghĩa xã hội như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Bảo vệ chế độ hôn nhân một vợ một chồng, thực hiện bình đẳng trong gia đình",
      "B. Chỉ tập trung xây dựng mô hình gia đình hạt nhân, bảo vệ chế độ hôn nhân một vợ một chồng",
      "C. Chỉ tập trung xây dựng mô hình gia đình mở rộng, thực hiện đoàn kết hòa thuận giữa các thành viên trong gia đình",
      "D. Xây dựng gia đình một vợ một chồng theo nguyên tắc gia trưởng"
    ],
    "correct": 1
  },
  {
    "text": "Để mỗi cá nhân phát triển toàn diện, chúng ta cần phải làm gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Coi trọng giáo của dục gia đình hơn giáo dục của xã hội",
      "B. Coi trọng giáo dục xã hội hơn giáo dục của gia đình",
      "C. Coi trọng cả giáo dục gia đình và giáo dục của xã hội",
      "D. Cho rằng các nội dung đạo đức giáo dục gia đình không có mối quan hê với giáo dục xã hội"
    ],
    "correct": 3
  },
  {
    "text": "Trong gia đình, một trong những biện pháp quan trọng nhất để xóa bỏ tình trạng bất công đối với phụ nữ là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Duy trì chế độ tư hữu về tư liệu sản xuất",
      "B. Duy trì, mở rộng chế độ công hữu về tư liệu sản xuất",
      "C. Xóa bỏ chế độ công hữu về tư liệu sản xuất",
      "D. Tất cả các đáp án"
    ],
    "correct": 2
  },
  {
    "text": "Cơ sở chính trị để giải phóng phụ nữ trong gia đình là:",
    "type": "Multiple Choice",
    "options": [
      "A. Nhà nước chiếm hữu nô lệ",
      "B. Nhà nước chủ nô",
      "C. Nhà nước phong kiến",
      "D. Nhà nước xã hội chủ nghĩa"
    ],
    "correct": 4
  },
  {
    "text": "Hôn nhân tiến bộ có đặc điểm gì ?",
    "type": "Multiple Choice",
    "options": [
      "A. Xuất phát từ tình yêu giữa nam và nữ",
      "B. Chỉ xuất phát từ lợi ích vật chất",
      "C. Chỉ xuất phát từ việc áp đặt của cha mẹ đối với con cái mà không dựa trên tình cảm đôi lứa",
      "D. Tất cả các đáp án"
    ],
    "correct": 1
  },
  {
    "text": "Cha mẹ cần làm gì đối với hôn nhân của con cái?",
    "type": "Multiple Choice",
    "options": [
      "A. Áp đặt hôn nhân của con theo ý muôn chủ quan của mình mà không cần tìm hiểu suy nghĩ của con",
      "B. Tôn trọng tuyệt đối sự lựa chọn của con cái và không có sự khuyên bảo",
      "C. Quan tâm, hướng dẫn giúp đỡ con cái có nhận thức đúng, có trách nhiệm trong việc kết hôn",
      "D. Áp đặt hôn nhân của con hoặc không bao giờ khuyên bảo"
    ],
    "correct": 3
  },
  {
    "text": "Mô hình gia đình nào đang trở nên rất phổ biến và chiếm đa số ở Viêt Nam hiện nay?",
    "type": "Multiple Choice",
    "options": [
      "A. Gia đình hạt hân với hai thế hệ",
      "B. Gia đình mở rộng với ba thế hệ",
      "C. Gia đình mở rộng với bốn thế hệ",
      "D. Tất cả các đáp án"
    ],
    "correct": 1
  },
  {
    "text": "Vấn đề bình đẳng nam nữ được đề cao hơn trong mô hình gia đình nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Gia đình mở rộng với ba thế hệ",
      "B. Gia đình mở rộng với bốn thế hệ",
      "C. Gia đình truyền thống",
      "D. Gia đình hạt nhân"
    ],
    "correct": 4
  },
  {
    "text": "Đặc điểm nổi bật của gia đình truyền thống ở Việt Nam trước đây là?",
    "type": "Multiple Choice",
    "options": [
      "A. Nam giới là trụ cột, mọi quyền lực trong gia đình đều thuộc về người đàn ông",
      "B. Phụ nữ là trụ cột, mọi quyền lực trong gia đình đều thuộc về người đàn bà",
      "C. Nam giới và phụ nữ đều có quyền lực và nghĩa vụ ngang nhau",
      "D. Tất cả các đáp án"
    ],
    "correct": 1
  },
  {
    "text": "Mặt tích cực của kinh tế thị trường và xu hướng toàn cầu hóa đang tác động đến gia đình Việt Nam hiện nay như thế nào?",
    "type": "Multiple Choice",
    "options": [
      "A. Làm cho đời sống vật chất của các gia đình được nâng cao, các thành viên được thừa hưởng tinh hoa văn hóa tốt đẹp của nhân loại",
      "B. Lối sống gia trưởng có điều kiện phát triển",
      "C. Tư tưởng trọng nam khinh nữ ngày càng phổ biến trong gia đình",
      "D. Tất cả các đáp án"
    ],
    "correct": 1
  },
  {
    "text": "Cha mẹ cần làm gì đối với hôn nhân của con cái?",
    "type": "Multiple Choice",
    "options": [
      "A. Áp đặt hôn nhân của con theo ý muốn chủ quan của mình mà không cần tìm hiểu suy nghĩ của con",
      "B. Tôn trọng tuyệt đối sự lựa chọn của con cái và không có sự khuyên bảo",
      "C. Quan tâm, hướng dẫn giúp đỡ con cái có nhận thức đúng, có trách nhiệm trong việc kết hôn",
      "D. Áp đặt hôn nhân của con hoặc không bao giờ khuyên bảo"
    ],
    "correct": 3
  },
  {
    "text": "Chỉ ra luận điểm đúng về gia đình?",
    "type": "Multiple Choice",
    "options": [
      "A. Gia đình là một cộng đồng xã hội đặc biệt, tồn tại lâu dài trong lịch sử xã hội.",
      "B. Gia đình là một cộng đồng xã hội đặc biệt, chỉ tồn tại trong một giai đoạn lịch sử nhất định.",
      "C. Gia đình là một tổ chức trong hệ thống chính trị cơ sở.",
      "D. Gia đình là cầu nối giữa các bộ phận trong hệ thống chính trị cơ sở."
    ],
    "correct": 1
  },
  {
    "text": "Cơ sở hình thành nên gia đình là gì?",
    "type": "Multiple Choice",
    "options": [
      "A. Quan hệ chính trị.",
      "B. Quan hệ văn hóa.",
      "C. Quan hệ hôn nhân.",
      "D. Quan hệ xã hội."
    ],
    "correct": 3
  },
  {
    "text": "Điền vào chỗ trống để hoàn thiện luận điểm của Chủ tịch Hồ Chí Minh: “Nhiều gia đình cộng lại mới thành xã hội, xã hội tốt thì gia đình càng tốt, gia đình tốt thì xã hội mới tốt. Hạt nhân của xã hội là (...)”.",
    "type": "Multiple Choice",
    "options": [
      "A. Cộng đồng.",
      "B. Gia đình.",
      "C. Cơ sở.",
      "D. Nhân dân."
    ],
    "correct": 2
  }
]
